TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.9 *
       3              ;* Date/Time created: Wed Dec 02 15:59:04 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.9 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_15\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    1184              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_17"), DW_AT_const_value(0x11)
    1185              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_18"), DW_AT_const_value(0x12)
    1186              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_19"), DW_AT_const_value(0x13)
    1187              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_20"), DW_AT_const_value(0x14)
    1188              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_21"), DW_AT_const_value(0x15)
    1189              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_22"), DW_AT_const_value(0x16)
    1190              $C$DW$263       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_23"), DW_AT_const_value(0x17)
    1191              $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_24"), DW_AT_const_value(0x18)
    1192              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_25"), DW_AT_const_value(0x19)
    1193              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_26"), DW_AT_const_value(0x1a)
    1194              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_27"), DW_AT_const_value(0x1b)
    1195              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_28"), DW_AT_const_value(0x1c)
    1196              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_29"), DW_AT_const_value(0x1d)
    1197              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    1198              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    1199              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    1200              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    1201              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    1202              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    1203              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    1204              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    1205              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    1206              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    1207                      .dwendtag $C$DW$T$135
    1208              
    1209              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    1210                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    1211                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    1212              $C$DW$280       .dwtag  DW_TAG_TI_far_type
    1213                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$136)
    1214              $C$DW$T$137     .dwtag  DW_TAG_const_type
    1215                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$280)
    1216              
    1217              $C$DW$T$138     .dwtag  DW_TAG_enumeration_type
    1218                      .dwattr $C$DW$T$138, DW_AT_byte_size(0x01)
    1219              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    1220              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    1221              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    1222              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    1223              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    1224              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    1225              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    1226              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    1227              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    1228              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    1229              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    1230              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    1231                      .dwendtag $C$DW$T$138
    1232              
    1233              $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    1234                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    1235                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    1236              
    1237              $C$DW$T$29      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   26

    1238                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    1239                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    1240              $C$DW$293       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$23)
    1242                      .dwattr $C$DW$293, DW_AT_name("ADCRESULT")
    1243                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_ADCRESULT")
    1244                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    1246              $C$DW$294       .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$24)
    1248                      .dwattr $C$DW$294, DW_AT_name("resvd_1")
    1249                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_resvd_1")
    1250                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1251                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    1252              $C$DW$295       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$22)
    1254                      .dwattr $C$DW$295, DW_AT_name("ADCCTL1")
    1255                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_ADCCTL1")
    1256                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    1257                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    1258              $C$DW$296       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$22)
    1260                      .dwattr $C$DW$296, DW_AT_name("ADCCTL2")
    1261                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_ADCCTL2")
    1262                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    1263                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    1264              $C$DW$297       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$25)
    1266                      .dwattr $C$DW$297, DW_AT_name("rsvd_2")
    1267                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_rsvd_2")
    1268                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    1269                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$298       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$22)
    1272                      .dwattr $C$DW$298, DW_AT_name("ADCINTFLG")
    1273                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_ADCINTFLG")
    1274                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    1275                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    1276              $C$DW$299       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
    1278                      .dwattr $C$DW$299, DW_AT_name("ADCINTFLGCLR")
    1279                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    1280                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    1281                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$300       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$22)
    1284                      .dwattr $C$DW$300, DW_AT_name("ADCINTOVF")
    1285                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_ADCINTOVF")
    1286                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    1287                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    1288              $C$DW$301       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$22)
    1290                      .dwattr $C$DW$301, DW_AT_name("ADCINTOVFCLR")
    1291                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    1292                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   27

    1293                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$302       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$26)
    1296                      .dwattr $C$DW$302, DW_AT_name("INTSELxNy")
    1297                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_INTSELxNy")
    1298                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    1299                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$303       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$27)
    1302                      .dwattr $C$DW$303, DW_AT_name("rsvd_3")
    1303                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_rsvd_3")
    1304                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    1305                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$304       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$22)
    1308                      .dwattr $C$DW$304, DW_AT_name("SOCPRICTRL")
    1309                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_SOCPRICTRL")
    1310                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    1311                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$305       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$22)
    1314                      .dwattr $C$DW$305, DW_AT_name("rsvd_4")
    1315                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_rsvd_4")
    1316                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    1317                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    1318              $C$DW$306       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$22)
    1320                      .dwattr $C$DW$306, DW_AT_name("ADCSAMPLEMODE")
    1321                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    1322                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    1323                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    1324              $C$DW$307       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    1326                      .dwattr $C$DW$307, DW_AT_name("rsvd_5")
    1327                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_rsvd_5")
    1328                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    1329                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    1330              $C$DW$308       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$22)
    1332                      .dwattr $C$DW$308, DW_AT_name("ADCINTSOCSEL1")
    1333                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    1334                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    1335                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$309       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$22)
    1338                      .dwattr $C$DW$309, DW_AT_name("ADCINTSOCSEL2")
    1339                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    1340                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    1341                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$310       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$25)
    1344                      .dwattr $C$DW$310, DW_AT_name("rsvd_6")
    1345                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_rsvd_6")
    1346                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    1347                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   28

    1348              $C$DW$311       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$22)
    1350                      .dwattr $C$DW$311, DW_AT_name("ADCSOCFLG1")
    1351                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    1352                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    1353                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$312       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$22)
    1356                      .dwattr $C$DW$312, DW_AT_name("rsvd_7")
    1357                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_rsvd_7")
    1358                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    1359                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    1360              $C$DW$313       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$22)
    1362                      .dwattr $C$DW$313, DW_AT_name("ADCSOCFRC1")
    1363                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    1364                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    1365                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$314       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$22)
    1368                      .dwattr $C$DW$314, DW_AT_name("rsvd_8")
    1369                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_rsvd_8")
    1370                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    1371                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    1372              $C$DW$315       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$22)
    1374                      .dwattr $C$DW$315, DW_AT_name("ADCSOCOVF1")
    1375                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    1376                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    1377                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$316       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$22)
    1380                      .dwattr $C$DW$316, DW_AT_name("rsvd_9")
    1381                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_rsvd_9")
    1382                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    1383                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$317       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$22)
    1386                      .dwattr $C$DW$317, DW_AT_name("ADCSOCOVFCLR1")
    1387                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    1388                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    1389                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$318       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$22)
    1392                      .dwattr $C$DW$318, DW_AT_name("rsvd_10")
    1393                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_rsvd_10")
    1394                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    1395                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$319       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$23)
    1398                      .dwattr $C$DW$319, DW_AT_name("ADCSOCxCTL")
    1399                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    1400                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    1401                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$320       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   29

    1403                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$23)
    1404                      .dwattr $C$DW$320, DW_AT_name("rsvd_11")
    1405                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_rsvd_11")
    1406                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    1407                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    1408              $C$DW$321       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$22)
    1410                      .dwattr $C$DW$321, DW_AT_name("ADCREFTRIM")
    1411                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_ADCREFTRIM")
    1412                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    1413                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$322       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$22)
    1416                      .dwattr $C$DW$322, DW_AT_name("ADCOFFTRIM")
    1417                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1418                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    1419                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    1420              $C$DW$323       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$28)
    1422                      .dwattr $C$DW$323, DW_AT_name("resvd_12")
    1423                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_resvd_12")
    1424                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    1425                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    1426              $C$DW$324       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$22)
    1428                      .dwattr $C$DW$324, DW_AT_name("ADCREV")
    1429                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_ADCREV")
    1430                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    1431                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    1432                      .dwendtag $C$DW$T$29
    1433              
    1434              $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    1435                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$29)
    1436                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    1437              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1438                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$29)
    1439                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    1440              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    1441                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1442                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1443              
    1444              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1445                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    1446                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    1447              $C$DW$325       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$22)
    1449                      .dwattr $C$DW$325, DW_AT_name("XCLK")
    1450                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_XCLK")
    1451                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    1453              $C$DW$326       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$22)
    1455                      .dwattr $C$DW$326, DW_AT_name("rsvd_1")
    1456                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_rsvd_1")
    1457                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   30

    1458                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    1459              $C$DW$327       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$22)
    1461                      .dwattr $C$DW$327, DW_AT_name("CLKCTL")
    1462                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_CLKCTL")
    1463                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1464                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$328       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$30)
    1467                      .dwattr $C$DW$328, DW_AT_name("rsvd_2")
    1468                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_rsvd_2")
    1469                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1470                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    1471              $C$DW$329       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$22)
    1473                      .dwattr $C$DW$329, DW_AT_name("LOSPCP")
    1474                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_LOSPCP")
    1475                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1476                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    1477              $C$DW$330       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$22)
    1479                      .dwattr $C$DW$330, DW_AT_name("PCLKCR0")
    1480                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_PCLKCR0")
    1481                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1482                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    1483              $C$DW$331       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$22)
    1485                      .dwattr $C$DW$331, DW_AT_name("PCLKCR1")
    1486                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_PCLKCR1")
    1487                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1488                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    1489              $C$DW$332       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$25)
    1491                      .dwattr $C$DW$332, DW_AT_name("rsvd_3")
    1492                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_rsvd_3")
    1493                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1494                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    1495              $C$DW$333       .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$22)
    1497                      .dwattr $C$DW$333, DW_AT_name("PCLKCR3")
    1498                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_PCLKCR3")
    1499                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1500                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    1501                      .dwendtag $C$DW$T$31
    1502              
    1503              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    1504                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$31)
    1505                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    1506              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    1507                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1508                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1509              
    1510              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1511                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    1512                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   31

    1513              $C$DW$334       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$32)
    1515                      .dwattr $C$DW$334, DW_AT_name("tmp")
    1516                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_tmp")
    1517                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    1519                      .dwendtag $C$DW$T$33
    1520              
    1521              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1522                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$33)
    1523                      .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    1524              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    1525                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1526                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1527              
    1528              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1529                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    1530                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1531              $C$DW$335       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$21)
    1533                      .dwattr $C$DW$335, DW_AT_name("rsvd")
    1534                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_rsvd")
    1535                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    1537              $C$DW$336       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$35)
    1539                      .dwattr $C$DW$336, DW_AT_name("targetProc")
    1540                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_targetProc")
    1541                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1542                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    1543              $C$DW$337       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    1545                      .dwattr $C$DW$337, DW_AT_name("major")
    1546                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_major")
    1547                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1548                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    1549              $C$DW$338       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$21)
    1551                      .dwattr $C$DW$338, DW_AT_name("minor")
    1552                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_minor")
    1553                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1554                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    1555                      .dwendtag $C$DW$T$36
    1556              
    1557              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    1558                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$36)
    1559                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1560              
    1561              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1562                      .dwattr $C$DW$T$38, DW_AT_name("_FILTER_FO_")
    1563                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    1564              $C$DW$339       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$37)
    1566                      .dwattr $C$DW$339, DW_AT_name("a1")
    1567                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_a1")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   32

    1568                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    1570              $C$DW$340       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$37)
    1572                      .dwattr $C$DW$340, DW_AT_name("b0")
    1573                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_b0")
    1574                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1575                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    1576              $C$DW$341       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$37)
    1578                      .dwattr $C$DW$341, DW_AT_name("b1")
    1579                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_b1")
    1580                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1581                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    1582              $C$DW$342       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$37)
    1584                      .dwattr $C$DW$342, DW_AT_name("x1")
    1585                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_x1")
    1586                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1587                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    1588              $C$DW$343       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$37)
    1590                      .dwattr $C$DW$343, DW_AT_name("y1")
    1591                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_y1")
    1592                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1593                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    1594                      .dwendtag $C$DW$T$38
    1595              
    1596              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    1597                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$38)
    1598                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1599              
    1600              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1601                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    1602                      .dwattr $C$DW$T$19, DW_AT_declaration
    1603                      .dwendtag $C$DW$T$19
    1604              
    1605              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    1606                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    1608              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    1609                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    1610                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1611              
    1612              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1613                      .dwattr $C$DW$T$39, DW_AT_name("_FLASH_Obj_")
    1614                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    1615              $C$DW$344       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    1617                      .dwattr $C$DW$344, DW_AT_name("FOPT")
    1618                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_FOPT")
    1619                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1620                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    1621              $C$DW$345       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   33

    1623                      .dwattr $C$DW$345, DW_AT_name("rsvd_1")
    1624                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_rsvd_1")
    1625                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1626                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    1627              $C$DW$346       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$22)
    1629                      .dwattr $C$DW$346, DW_AT_name("FPWR")
    1630                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_FPWR")
    1631                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1632                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    1633              $C$DW$347       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
    1635                      .dwattr $C$DW$347, DW_AT_name("FSTATUS")
    1636                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_FSTATUS")
    1637                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1638                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    1639              $C$DW$348       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$22)
    1641                      .dwattr $C$DW$348, DW_AT_name("FSTDBYWAIT")
    1642                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1643                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1644                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    1645              $C$DW$349       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$22)
    1647                      .dwattr $C$DW$349, DW_AT_name("FACTIVEWAIT")
    1648                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1649                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1650                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$350       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    1653                      .dwattr $C$DW$350, DW_AT_name("FBANKWAIT")
    1654                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_FBANKWAIT")
    1655                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1656                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$351       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$22)
    1659                      .dwattr $C$DW$351, DW_AT_name("FOTPWAIT")
    1660                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_FOTPWAIT")
    1661                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1662                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    1663                      .dwendtag $C$DW$T$39
    1664              
    1665              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    1666                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$39)
    1667                      .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    1668              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    1669                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1670                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1671              
    1672              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1673                      .dwattr $C$DW$T$44, DW_AT_name("_GPIO_Obj_")
    1674                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x6a)
    1675              $C$DW$352       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$41)
    1677                      .dwattr $C$DW$352, DW_AT_name("GPACTRL")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   34

    1678                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_GPACTRL")
    1679                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$353       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$41)
    1683                      .dwattr $C$DW$353, DW_AT_name("GPAQSEL1")
    1684                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_GPAQSEL1")
    1685                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1686                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    1687              $C$DW$354       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$41)
    1689                      .dwattr $C$DW$354, DW_AT_name("GPAQSEL2")
    1690                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_GPAQSEL2")
    1691                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1692                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$355       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$41)
    1695                      .dwattr $C$DW$355, DW_AT_name("GPAMUX1")
    1696                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_GPAMUX1")
    1697                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1698                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$356       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$41)
    1701                      .dwattr $C$DW$356, DW_AT_name("GPAMUX2")
    1702                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_GPAMUX2")
    1703                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1704                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$357       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$41)
    1707                      .dwattr $C$DW$357, DW_AT_name("GPADIR")
    1708                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_GPADIR")
    1709                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1710                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$358       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$41)
    1713                      .dwattr $C$DW$358, DW_AT_name("GPAPUD")
    1714                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_GPAPUD")
    1715                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1716                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$359       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$25)
    1719                      .dwattr $C$DW$359, DW_AT_name("rsvd_1")
    1720                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_rsvd_1")
    1721                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1722                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$360       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$41)
    1725                      .dwattr $C$DW$360, DW_AT_name("GPBCTRL")
    1726                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_GPBCTRL")
    1727                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1728                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    1729              $C$DW$361       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$41)
    1731                      .dwattr $C$DW$361, DW_AT_name("GPBQSEL1")
    1732                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_GPBQSEL1")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   35

    1733                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1734                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$362       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$25)
    1737                      .dwattr $C$DW$362, DW_AT_name("rsvd_2")
    1738                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_rsvd_2")
    1739                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1740                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    1741              $C$DW$363       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$41)
    1743                      .dwattr $C$DW$363, DW_AT_name("GPBMUX1")
    1744                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_GPBMUX1")
    1745                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1746                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$364       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$25)
    1749                      .dwattr $C$DW$364, DW_AT_name("rsvd_3")
    1750                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_rsvd_3")
    1751                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1752                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    1753              $C$DW$365       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$41)
    1755                      .dwattr $C$DW$365, DW_AT_name("GPBDIR")
    1756                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_GPBDIR")
    1757                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1758                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$366       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$41)
    1761                      .dwattr $C$DW$366, DW_AT_name("GPBPUD")
    1762                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_GPBPUD")
    1763                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1764                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$367       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$42)
    1767                      .dwattr $C$DW$367, DW_AT_name("rsvd_4")
    1768                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rsvd_4")
    1769                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1770                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$368       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$41)
    1773                      .dwattr $C$DW$368, DW_AT_name("AIOMUX1")
    1774                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_AIOMUX1")
    1775                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1776                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$369       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$25)
    1779                      .dwattr $C$DW$369, DW_AT_name("rsvd_5")
    1780                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd_5")
    1781                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1782                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$370       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$41)
    1785                      .dwattr $C$DW$370, DW_AT_name("AIODIR")
    1786                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_AIODIR")
    1787                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   36

    1788                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$371       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$43)
    1791                      .dwattr $C$DW$371, DW_AT_name("rsvd_6")
    1792                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd_6")
    1793                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1794                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    1795              $C$DW$372       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$41)
    1797                      .dwattr $C$DW$372, DW_AT_name("GPADAT")
    1798                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_GPADAT")
    1799                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1800                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$373       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$41)
    1803                      .dwattr $C$DW$373, DW_AT_name("GPASET")
    1804                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_GPASET")
    1805                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1806                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$374       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$41)
    1809                      .dwattr $C$DW$374, DW_AT_name("GPACLEAR")
    1810                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_GPACLEAR")
    1811                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1812                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$375       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$41)
    1815                      .dwattr $C$DW$375, DW_AT_name("GPATOGGLE")
    1816                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_GPATOGGLE")
    1817                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1818                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$376       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$41)
    1821                      .dwattr $C$DW$376, DW_AT_name("GPBDAT")
    1822                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_GPBDAT")
    1823                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1824                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$377       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$41)
    1827                      .dwattr $C$DW$377, DW_AT_name("GPBSET")
    1828                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_GPBSET")
    1829                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1830                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$378       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$41)
    1833                      .dwattr $C$DW$378, DW_AT_name("GPBCLEAR")
    1834                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_GPBCLEAR")
    1835                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1836                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$379       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$41)
    1839                      .dwattr $C$DW$379, DW_AT_name("GPBTOGGLE")
    1840                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1841                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1842                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   37

    1843              $C$DW$380       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$30)
    1845                      .dwattr $C$DW$380, DW_AT_name("rsvd_7")
    1846                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd_7")
    1847                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1848                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$381       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$41)
    1851                      .dwattr $C$DW$381, DW_AT_name("AIODAT")
    1852                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_AIODAT")
    1853                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1854                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$382       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$41)
    1857                      .dwattr $C$DW$382, DW_AT_name("AIOSET")
    1858                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_AIOSET")
    1859                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1860                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$383       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$41)
    1863                      .dwattr $C$DW$383, DW_AT_name("AIOCLEAR")
    1864                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_AIOCLEAR")
    1865                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1866                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$384       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$41)
    1869                      .dwattr $C$DW$384, DW_AT_name("AIOTOGGLE")
    1870                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1871                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1872                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$385       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$27)
    1875                      .dwattr $C$DW$385, DW_AT_name("GPIOXINTnSEL")
    1876                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    1877                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1878                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    1879              $C$DW$386       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$26)
    1881                      .dwattr $C$DW$386, DW_AT_name("rsvd_8")
    1882                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd_8")
    1883                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1884                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$387       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$41)
    1887                      .dwattr $C$DW$387, DW_AT_name("GPIOLPMSEL")
    1888                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1889                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1890                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    1891                      .dwendtag $C$DW$T$44
    1892              
    1893              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1894                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$44)
    1895                      .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    1896              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1897                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   38

    1898                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1899              
    1900              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1901                      .dwattr $C$DW$T$46, DW_AT_name("_HAL_AdcData_t_")
    1902                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x0e)
    1903              $C$DW$388       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$45)
    1905                      .dwattr $C$DW$388, DW_AT_name("I")
    1906                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_I")
    1907                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$389       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$45)
    1911                      .dwattr $C$DW$389, DW_AT_name("V")
    1912                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_V")
    1913                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1914                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$390       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$37)
    1917                      .dwattr $C$DW$390, DW_AT_name("dcBus")
    1918                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_dcBus")
    1919                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1920                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    1921                      .dwendtag $C$DW$T$46
    1922              
    1923              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    1924                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$46)
    1925                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1926              
    1927              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    1928                      .dwattr $C$DW$T$79, DW_AT_name("_HAL_Obj_")
    1929                      .dwattr $C$DW$T$79, DW_AT_byte_size(0xa6)
    1930              $C$DW$391       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$48)
    1932                      .dwattr $C$DW$391, DW_AT_name("adcHandle")
    1933                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_adcHandle")
    1934                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    1936              $C$DW$392       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$50)
    1938                      .dwattr $C$DW$392, DW_AT_name("clkHandle")
    1939                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_clkHandle")
    1940                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1941                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    1942              $C$DW$393       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$52)
    1944                      .dwattr $C$DW$393, DW_AT_name("cpuHandle")
    1945                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_cpuHandle")
    1946                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1947                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    1948              $C$DW$394       .dwtag  DW_TAG_member
    1949                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$54)
    1950                      .dwattr $C$DW$394, DW_AT_name("flashHandle")
    1951                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_flashHandle")
    1952                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   39

    1953                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    1954              $C$DW$395       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$56)
    1956                      .dwattr $C$DW$395, DW_AT_name("gpioHandle")
    1957                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_gpioHandle")
    1958                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1959                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    1960              $C$DW$396       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$59)
    1962                      .dwattr $C$DW$396, DW_AT_name("offsetHandle_I")
    1963                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_offsetHandle_I")
    1964                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1965                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    1966              $C$DW$397       .dwtag  DW_TAG_member
    1967                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$61)
    1968                      .dwattr $C$DW$397, DW_AT_name("offset_I")
    1969                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_offset_I")
    1970                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1971                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    1972              $C$DW$398       .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$59)
    1974                      .dwattr $C$DW$398, DW_AT_name("offsetHandle_V")
    1975                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_offsetHandle_V")
    1976                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1977                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    1978              $C$DW$399       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$61)
    1980                      .dwattr $C$DW$399, DW_AT_name("offset_V")
    1981                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_offset_V")
    1982                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1983                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    1984              $C$DW$400       .dwtag  DW_TAG_member
    1985                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$63)
    1986                      .dwattr $C$DW$400, DW_AT_name("oscHandle")
    1987                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_oscHandle")
    1988                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1989                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    1990              $C$DW$401       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$65)
    1992                      .dwattr $C$DW$401, DW_AT_name("pieHandle")
    1993                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_pieHandle")
    1994                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1995                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    1996              $C$DW$402       .dwtag  DW_TAG_member
    1997                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$67)
    1998                      .dwattr $C$DW$402, DW_AT_name("pllHandle")
    1999                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_pllHandle")
    2000                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2001                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2002              $C$DW$403       .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$70)
    2004                      .dwattr $C$DW$403, DW_AT_name("pwmHandle")
    2005                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_pwmHandle")
    2006                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2007                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   40

    2008              $C$DW$404       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$70)
    2010                      .dwattr $C$DW$404, DW_AT_name("pwmDacHandle")
    2011                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_pwmDacHandle")
    2012                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2013                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    2014              $C$DW$405       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$72)
    2016                      .dwattr $C$DW$405, DW_AT_name("pwrHandle")
    2017                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_pwrHandle")
    2018                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2019                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    2020              $C$DW$406       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$75)
    2022                      .dwattr $C$DW$406, DW_AT_name("timerHandle")
    2023                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_timerHandle")
    2024                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2025                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    2026              $C$DW$407       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$77)
    2028                      .dwattr $C$DW$407, DW_AT_name("wdogHandle")
    2029                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_wdogHandle")
    2030                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2031                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    2032              $C$DW$408       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$78)
    2034                      .dwattr $C$DW$408, DW_AT_name("adcBias")
    2035                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_adcBias")
    2036                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2037                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    2038              $C$DW$409       .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$37)
    2040                      .dwattr $C$DW$409, DW_AT_name("current_sf")
    2041                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_current_sf")
    2042                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2043                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    2044              $C$DW$410       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$37)
    2046                      .dwattr $C$DW$410, DW_AT_name("voltage_sf")
    2047                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_voltage_sf")
    2048                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2049                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    2050              $C$DW$411       .dwtag  DW_TAG_member
    2051                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$32)
    2052                      .dwattr $C$DW$411, DW_AT_name("numCurrentSensors")
    2053                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_numCurrentSensors")
    2054                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2055                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    2056              $C$DW$412       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$32)
    2058                      .dwattr $C$DW$412, DW_AT_name("numVoltageSensors")
    2059                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_numVoltageSensors")
    2060                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xa5]
    2061                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    2062                      .dwendtag $C$DW$T$79
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   41

    2063              
    2064              $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    2065                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$79)
    2066                      .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    2067              $C$DW$T$145     .dwtag  DW_TAG_pointer_type
    2068                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
    2069                      .dwattr $C$DW$T$145, DW_AT_address_class(0x20)
    2070              $C$DW$T$146     .dwtag  DW_TAG_pointer_type
    2071                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$79)
    2072                      .dwattr $C$DW$T$146, DW_AT_address_class(0x20)
    2073              $C$DW$T$147     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    2074                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
    2075                      .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    2076              
    2077              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    2078                      .dwattr $C$DW$T$80, DW_AT_name("_HAL_PwmData_t_")
    2079                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x06)
    2080              $C$DW$413       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$45)
    2082                      .dwattr $C$DW$413, DW_AT_name("Tabc")
    2083                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Tabc")
    2084                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    2086                      .dwendtag $C$DW$T$80
    2087              
    2088              $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_PwmData_t")
    2089                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$80)
    2090                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    2091              
    2092              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    2093                      .dwattr $C$DW$T$82, DW_AT_name("_MATH_vec3_")
    2094                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x06)
    2095              $C$DW$414       .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$81)
    2097                      .dwattr $C$DW$414, DW_AT_name("value")
    2098                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_value")
    2099                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2101                      .dwendtag $C$DW$T$82
    2102              
    2103              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    2104                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$82)
    2105                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2106              
    2107              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    2108                      .dwattr $C$DW$T$92, DW_AT_name("_MOTOR_Vars_t_")
    2109                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x68)
    2110              $C$DW$415       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$83)
    2112                      .dwattr $C$DW$415, DW_AT_name("Flag_enableSys")
    2113                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Flag_enableSys")
    2114                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2115                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2116              $C$DW$416       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$83)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   42

    2118                      .dwattr $C$DW$416, DW_AT_name("Flag_Run_Identify")
    2119                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Flag_Run_Identify")
    2120                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2121                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$417       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$83)
    2124                      .dwattr $C$DW$417, DW_AT_name("Flag_MotorIdentified")
    2125                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
    2126                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2127                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2128              $C$DW$418       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$83)
    2130                      .dwattr $C$DW$418, DW_AT_name("Flag_enableForceAngle")
    2131                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
    2132                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2133                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2134              $C$DW$419       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$83)
    2136                      .dwattr $C$DW$419, DW_AT_name("Flag_enableFieldWeakening")
    2137                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Flag_enableFieldWeakening")
    2138                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2139                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$420       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$83)
    2142                      .dwattr $C$DW$420, DW_AT_name("Flag_enableRsRecalc")
    2143                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
    2144                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2145                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    2146              $C$DW$421       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$83)
    2148                      .dwattr $C$DW$421, DW_AT_name("Flag_enableUserParams")
    2149                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Flag_enableUserParams")
    2150                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2151                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$422       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$83)
    2154                      .dwattr $C$DW$422, DW_AT_name("Flag_enableOffsetcalc")
    2155                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
    2156                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2157                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    2158              $C$DW$423       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$83)
    2160                      .dwattr $C$DW$423, DW_AT_name("Flag_enablePowerWarp")
    2161                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
    2162                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2163                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$424       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$83)
    2166                      .dwattr $C$DW$424, DW_AT_name("Flag_enableSpeedCtrl")
    2167                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
    2168                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2169                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    2170              $C$DW$425       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$85)
    2172                      .dwattr $C$DW$425, DW_AT_name("CtrlState")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   43

    2173                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_CtrlState")
    2174                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2175                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    2176              $C$DW$426       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$87)
    2178                      .dwattr $C$DW$426, DW_AT_name("EstState")
    2179                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_EstState")
    2180                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2181                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    2182              $C$DW$427       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$89)
    2184                      .dwattr $C$DW$427, DW_AT_name("UserErrorCode")
    2185                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_UserErrorCode")
    2186                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2187                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$428       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$90)
    2190                      .dwattr $C$DW$428, DW_AT_name("CtrlVersion")
    2191                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_CtrlVersion")
    2192                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2193                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$429       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$37)
    2196                      .dwattr $C$DW$429, DW_AT_name("IdRef_A")
    2197                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_IdRef_A")
    2198                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2199                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$430       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$37)
    2202                      .dwattr $C$DW$430, DW_AT_name("IqRef_A")
    2203                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_IqRef_A")
    2204                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2205                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$431       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$37)
    2208                      .dwattr $C$DW$431, DW_AT_name("SpeedRef_pu")
    2209                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_SpeedRef_pu")
    2210                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2211                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$432       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$37)
    2214                      .dwattr $C$DW$432, DW_AT_name("SpeedRef_krpm")
    2215                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_SpeedRef_krpm")
    2216                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2217                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    2218              $C$DW$433       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$37)
    2220                      .dwattr $C$DW$433, DW_AT_name("SpeedTraj_krpm")
    2221                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_SpeedTraj_krpm")
    2222                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2223                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    2224              $C$DW$434       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$37)
    2226                      .dwattr $C$DW$434, DW_AT_name("MaxAccel_krpmps")
    2227                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_MaxAccel_krpmps")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   44

    2228                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2229                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$435       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$37)
    2232                      .dwattr $C$DW$435, DW_AT_name("Speed_krpm")
    2233                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_Speed_krpm")
    2234                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2235                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$436       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$37)
    2238                      .dwattr $C$DW$436, DW_AT_name("OverModulation")
    2239                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_OverModulation")
    2240                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2241                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$437       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$37)
    2244                      .dwattr $C$DW$437, DW_AT_name("RsOnLineCurrent_A")
    2245                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_RsOnLineCurrent_A")
    2246                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2247                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    2248              $C$DW$438       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$37)
    2250                      .dwattr $C$DW$438, DW_AT_name("SvgenMaxModulation_ticks")
    2251                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_SvgenMaxModulation_ticks")
    2252                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2253                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    2254              $C$DW$439       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$37)
    2256                      .dwattr $C$DW$439, DW_AT_name("Flux_Wb")
    2257                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_Flux_Wb")
    2258                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2259                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    2260              $C$DW$440       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$37)
    2262                      .dwattr $C$DW$440, DW_AT_name("Torque_Nm")
    2263                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_Torque_Nm")
    2264                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2265                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    2266              $C$DW$441       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$91)
    2268                      .dwattr $C$DW$441, DW_AT_name("MagnCurr_A")
    2269                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_MagnCurr_A")
    2270                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2271                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    2272              $C$DW$442       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$91)
    2274                      .dwattr $C$DW$442, DW_AT_name("Rr_Ohm")
    2275                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_Rr_Ohm")
    2276                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2277                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    2278              $C$DW$443       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$91)
    2280                      .dwattr $C$DW$443, DW_AT_name("Rs_Ohm")
    2281                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Rs_Ohm")
    2282                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   45

    2283                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    2284              $C$DW$444       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$91)
    2286                      .dwattr $C$DW$444, DW_AT_name("RsOnLine_Ohm")
    2287                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RsOnLine_Ohm")
    2288                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2289                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    2290              $C$DW$445       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$91)
    2292                      .dwattr $C$DW$445, DW_AT_name("Lsd_H")
    2293                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Lsd_H")
    2294                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2295                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    2296              $C$DW$446       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$91)
    2298                      .dwattr $C$DW$446, DW_AT_name("Lsq_H")
    2299                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Lsq_H")
    2300                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2301                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    2302              $C$DW$447       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$91)
    2304                      .dwattr $C$DW$447, DW_AT_name("Flux_VpHz")
    2305                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_Flux_VpHz")
    2306                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2307                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    2308              $C$DW$448       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$91)
    2310                      .dwattr $C$DW$448, DW_AT_name("ipd_excFreq_Hz")
    2311                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_ipd_excFreq_Hz")
    2312                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2313                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    2314              $C$DW$449       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$37)
    2316                      .dwattr $C$DW$449, DW_AT_name("ipd_Kspd")
    2317                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_ipd_Kspd")
    2318                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2319                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    2320              $C$DW$450       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$37)
    2322                      .dwattr $C$DW$450, DW_AT_name("ipd_excMag_coarse_pu")
    2323                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_ipd_excMag_coarse_pu")
    2324                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2325                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    2326              $C$DW$451       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$37)
    2328                      .dwattr $C$DW$451, DW_AT_name("ipd_excMag_fine_pu")
    2329                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_ipd_excMag_fine_pu")
    2330                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2331                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    2332              $C$DW$452       .dwtag  DW_TAG_member
    2333                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$16)
    2334                      .dwattr $C$DW$452, DW_AT_name("ipd_waitTime_coarse_sec")
    2335                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_ipd_waitTime_coarse_sec")
    2336                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2337                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 15:59:04 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\1536410                          PAGE   46

    2338              $C$DW$453       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$16)
    2340                      .dwattr $C$DW$453, DW_AT_name("ipd_waitTime_fine_sec")
    2341                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_ipd_waitTime_fine_sec")
    2342                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2343                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    2344              $C$DW$454       .dwtag  DW_TAG_member
    2345                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$37)
    2346                      .dwattr $C$DW$454, DW_AT_name("Kp_spd")
    2347                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Kp_spd")
    2348                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2349                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    2350              $C$DW$455       .dwtag  DW_TAG_member
    2351                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$37)
    2352                      .dwattr $C$DW$455, DW_AT_name("Ki_spd")
    2353                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_Ki_spd")
    2354                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2355                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    2356              $C$DW$456       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$37)
    2358                      .dwattr $C$DW$456, DW_AT_name("Kp_Idq")
    2359                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_Kp_Idq")
    2360                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2361                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    2362              $C$DW$457       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$37)
    2364                      .dwattr $C$DW$457, DW_AT_name("Ki_Idq")
    2365                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_Ki_Idq")
    2366                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2367                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    2368              $C$DW$458       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$37)
    2370                      .dwattr $C$DW$458, DW_AT_name("Vd")
    2371                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_Vd")
    2372                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2373                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    2374              $C$DW$459       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$37)
    2376                      .dwattr $C$DW$459, DW_AT_name("Vq")
    2377                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_Vq")
    2378                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2379                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    2380              $C$DW$460       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$37)
    2382                      .dwattr $C$DW$460, DW_AT_name("Vs")
    2383                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_Vs")
