TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.9 *
       3              ;* Date/Time created: Wed Dec 02 17:22:49 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.9 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_15\sw\solutions\instaspin_foc\boa
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6469              $C$DW$608       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    6470              $C$DW$609       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6471              $C$DW$610       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6472              $C$DW$611       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6473              $C$DW$612       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6474              $C$DW$613       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6475              $C$DW$614       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6476              $C$DW$615       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6477              $C$DW$616       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6478              $C$DW$617       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6479              $C$DW$618       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6480              $C$DW$619       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6481                      .dwendtag $C$DW$T$152
    6482              
    6483              $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6484                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    6485                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    6486              
    6487              $C$DW$T$162     .dwtag  DW_TAG_enumeration_type
    6488                      .dwattr $C$DW$T$162, DW_AT_byte_size(0x01)
    6489              $C$DW$620       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6490              $C$DW$621       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6491              $C$DW$622       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6492              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6493              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6494              $C$DW$625       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6495              $C$DW$626       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6496              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6497              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6498              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6499              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6500              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6501              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6502              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6503              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6504                      .dwendtag $C$DW$T$162
    6505              
    6506              $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6507                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
    6508                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    6509              
    6510              $C$DW$T$167     .dwtag  DW_TAG_enumeration_type
    6511                      .dwattr $C$DW$T$167, DW_AT_byte_size(0x01)
    6512              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6513              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  126

    6514              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6515                      .dwendtag $C$DW$T$167
    6516              
    6517              $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6518                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$167)
    6519                      .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    6520              $C$DW$638       .dwtag  DW_TAG_TI_far_type
    6521                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$168)
    6522              $C$DW$T$169     .dwtag  DW_TAG_const_type
    6523                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$638)
    6524              
    6525              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6526                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    6527                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    6528              $C$DW$639       .dwtag  DW_TAG_member
    6529                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$24)
    6530                      .dwattr $C$DW$639, DW_AT_name("ADCRESULT")
    6531                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_ADCRESULT")
    6532                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6533                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6534              $C$DW$640       .dwtag  DW_TAG_member
    6535                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$25)
    6536                      .dwattr $C$DW$640, DW_AT_name("resvd_1")
    6537                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_resvd_1")
    6538                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6539                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6540              $C$DW$641       .dwtag  DW_TAG_member
    6541                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$23)
    6542                      .dwattr $C$DW$641, DW_AT_name("ADCCTL1")
    6543                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_ADCCTL1")
    6544                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6545                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6546              $C$DW$642       .dwtag  DW_TAG_member
    6547                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$23)
    6548                      .dwattr $C$DW$642, DW_AT_name("ADCCTL2")
    6549                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_ADCCTL2")
    6550                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6551                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6552              $C$DW$643       .dwtag  DW_TAG_member
    6553                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$26)
    6554                      .dwattr $C$DW$643, DW_AT_name("rsvd_2")
    6555                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_rsvd_2")
    6556                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6557                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6558              $C$DW$644       .dwtag  DW_TAG_member
    6559                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$23)
    6560                      .dwattr $C$DW$644, DW_AT_name("ADCINTFLG")
    6561                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_ADCINTFLG")
    6562                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6563                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6564              $C$DW$645       .dwtag  DW_TAG_member
    6565                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$23)
    6566                      .dwattr $C$DW$645, DW_AT_name("ADCINTFLGCLR")
    6567                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6568                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  127

    6569                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6570              $C$DW$646       .dwtag  DW_TAG_member
    6571                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$23)
    6572                      .dwattr $C$DW$646, DW_AT_name("ADCINTOVF")
    6573                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_ADCINTOVF")
    6574                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6575                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6576              $C$DW$647       .dwtag  DW_TAG_member
    6577                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$23)
    6578                      .dwattr $C$DW$647, DW_AT_name("ADCINTOVFCLR")
    6579                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6580                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6581                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6582              $C$DW$648       .dwtag  DW_TAG_member
    6583                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$27)
    6584                      .dwattr $C$DW$648, DW_AT_name("INTSELxNy")
    6585                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_INTSELxNy")
    6586                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6587                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6588              $C$DW$649       .dwtag  DW_TAG_member
    6589                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$28)
    6590                      .dwattr $C$DW$649, DW_AT_name("rsvd_3")
    6591                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_rsvd_3")
    6592                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6593                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6594              $C$DW$650       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$23)
    6596                      .dwattr $C$DW$650, DW_AT_name("SOCPRICTRL")
    6597                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6598                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6599                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6600              $C$DW$651       .dwtag  DW_TAG_member
    6601                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$23)
    6602                      .dwattr $C$DW$651, DW_AT_name("rsvd_4")
    6603                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd_4")
    6604                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6605                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6606              $C$DW$652       .dwtag  DW_TAG_member
    6607                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$23)
    6608                      .dwattr $C$DW$652, DW_AT_name("ADCSAMPLEMODE")
    6609                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6610                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6611                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6612              $C$DW$653       .dwtag  DW_TAG_member
    6613                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$23)
    6614                      .dwattr $C$DW$653, DW_AT_name("rsvd_5")
    6615                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_rsvd_5")
    6616                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6617                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6618              $C$DW$654       .dwtag  DW_TAG_member
    6619                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$23)
    6620                      .dwattr $C$DW$654, DW_AT_name("ADCINTSOCSEL1")
    6621                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6622                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6623                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  128

    6624              $C$DW$655       .dwtag  DW_TAG_member
    6625                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$23)
    6626                      .dwattr $C$DW$655, DW_AT_name("ADCINTSOCSEL2")
    6627                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6628                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6629                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6630              $C$DW$656       .dwtag  DW_TAG_member
    6631                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$26)
    6632                      .dwattr $C$DW$656, DW_AT_name("rsvd_6")
    6633                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_rsvd_6")
    6634                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6635                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6636              $C$DW$657       .dwtag  DW_TAG_member
    6637                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$23)
    6638                      .dwattr $C$DW$657, DW_AT_name("ADCSOCFLG1")
    6639                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6640                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6641                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6642              $C$DW$658       .dwtag  DW_TAG_member
    6643                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$23)
    6644                      .dwattr $C$DW$658, DW_AT_name("rsvd_7")
    6645                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd_7")
    6646                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6647                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6648              $C$DW$659       .dwtag  DW_TAG_member
    6649                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$23)
    6650                      .dwattr $C$DW$659, DW_AT_name("ADCSOCFRC1")
    6651                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6652                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6653                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6654              $C$DW$660       .dwtag  DW_TAG_member
    6655                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$23)
    6656                      .dwattr $C$DW$660, DW_AT_name("rsvd_8")
    6657                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_rsvd_8")
    6658                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6659                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6660              $C$DW$661       .dwtag  DW_TAG_member
    6661                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$23)
    6662                      .dwattr $C$DW$661, DW_AT_name("ADCSOCOVF1")
    6663                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6664                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6665                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6666              $C$DW$662       .dwtag  DW_TAG_member
    6667                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$23)
    6668                      .dwattr $C$DW$662, DW_AT_name("rsvd_9")
    6669                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_rsvd_9")
    6670                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6671                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6672              $C$DW$663       .dwtag  DW_TAG_member
    6673                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$23)
    6674                      .dwattr $C$DW$663, DW_AT_name("ADCSOCOVFCLR1")
    6675                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6676                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6677                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6678              $C$DW$664       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  129

    6679                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$23)
    6680                      .dwattr $C$DW$664, DW_AT_name("rsvd_10")
    6681                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_rsvd_10")
    6682                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6683                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6684              $C$DW$665       .dwtag  DW_TAG_member
    6685                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$24)
    6686                      .dwattr $C$DW$665, DW_AT_name("ADCSOCxCTL")
    6687                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6688                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6689                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6690              $C$DW$666       .dwtag  DW_TAG_member
    6691                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$24)
    6692                      .dwattr $C$DW$666, DW_AT_name("rsvd_11")
    6693                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_rsvd_11")
    6694                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6695                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6696              $C$DW$667       .dwtag  DW_TAG_member
    6697                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$23)
    6698                      .dwattr $C$DW$667, DW_AT_name("ADCREFTRIM")
    6699                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6700                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6701                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6702              $C$DW$668       .dwtag  DW_TAG_member
    6703                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$23)
    6704                      .dwattr $C$DW$668, DW_AT_name("ADCOFFTRIM")
    6705                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6706                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6707                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6708              $C$DW$669       .dwtag  DW_TAG_member
    6709                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$29)
    6710                      .dwattr $C$DW$669, DW_AT_name("resvd_12")
    6711                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_resvd_12")
    6712                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6713                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6714              $C$DW$670       .dwtag  DW_TAG_member
    6715                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$23)
    6716                      .dwattr $C$DW$670, DW_AT_name("ADCREV")
    6717                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCREV")
    6718                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6719                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6720                      .dwendtag $C$DW$T$30
    6721              
    6722              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    6723                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$30)
    6724                      .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    6725              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6726                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    6727                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    6728              
    6729              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6730                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    6731                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    6732              $C$DW$671       .dwtag  DW_TAG_member
    6733                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  130

    6734                      .dwattr $C$DW$671, DW_AT_name("alpha_sf")
    6735                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_alpha_sf")
    6736                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6737                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6738              $C$DW$672       .dwtag  DW_TAG_member
    6739                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$31)
    6740                      .dwattr $C$DW$672, DW_AT_name("beta_sf")
    6741                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_beta_sf")
    6742                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6743                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6744              $C$DW$673       .dwtag  DW_TAG_member
    6745                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$32)
    6746                      .dwattr $C$DW$673, DW_AT_name("numSensors")
    6747                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_numSensors")
    6748                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6749                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6750                      .dwendtag $C$DW$T$33
    6751              
    6752              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6753                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    6754                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6755              $C$DW$T$170     .dwtag  DW_TAG_pointer_type
    6756                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$44)
    6757                      .dwattr $C$DW$T$170, DW_AT_address_class(0x20)
    6758              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    6759                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    6760                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    6761              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6762                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    6763                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    6764              
    6765              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6766                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    6767                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    6768              $C$DW$674       .dwtag  DW_TAG_member
    6769                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$23)
    6770                      .dwattr $C$DW$674, DW_AT_name("XCLK")
    6771                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_XCLK")
    6772                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6773                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6774              $C$DW$675       .dwtag  DW_TAG_member
    6775                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$23)
    6776                      .dwattr $C$DW$675, DW_AT_name("rsvd_1")
    6777                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_rsvd_1")
    6778                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6779                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6780              $C$DW$676       .dwtag  DW_TAG_member
    6781                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$23)
    6782                      .dwattr $C$DW$676, DW_AT_name("CLKCTL")
    6783                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_CLKCTL")
    6784                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6785                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6786              $C$DW$677       .dwtag  DW_TAG_member
    6787                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$34)
    6788                      .dwattr $C$DW$677, DW_AT_name("rsvd_2")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  131

    6789                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_rsvd_2")
    6790                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6791                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6792              $C$DW$678       .dwtag  DW_TAG_member
    6793                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$23)
    6794                      .dwattr $C$DW$678, DW_AT_name("LOSPCP")
    6795                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_LOSPCP")
    6796                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6797                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6798              $C$DW$679       .dwtag  DW_TAG_member
    6799                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$23)
    6800                      .dwattr $C$DW$679, DW_AT_name("PCLKCR0")
    6801                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_PCLKCR0")
    6802                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6803                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6804              $C$DW$680       .dwtag  DW_TAG_member
    6805                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$23)
    6806                      .dwattr $C$DW$680, DW_AT_name("PCLKCR1")
    6807                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_PCLKCR1")
    6808                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6809                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6810              $C$DW$681       .dwtag  DW_TAG_member
    6811                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$26)
    6812                      .dwattr $C$DW$681, DW_AT_name("rsvd_3")
    6813                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_rsvd_3")
    6814                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6815                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6816              $C$DW$682       .dwtag  DW_TAG_member
    6817                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    6818                      .dwattr $C$DW$682, DW_AT_name("PCLKCR3")
    6819                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_PCLKCR3")
    6820                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6821                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6822                      .dwendtag $C$DW$T$35
    6823              
    6824              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    6825                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$35)
    6826                      .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    6827              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6828                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    6829                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    6830              
    6831              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6832                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    6833                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    6834              $C$DW$683       .dwtag  DW_TAG_member
    6835                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$32)
    6836                      .dwattr $C$DW$683, DW_AT_name("tmp")
    6837                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_tmp")
    6838                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6839                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6840                      .dwendtag $C$DW$T$36
    6841              
    6842              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    6843                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$36)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  132

    6844                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    6845              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6846                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    6847                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    6848              
    6849              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6850                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    6851                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    6852              $C$DW$684       .dwtag  DW_TAG_member
    6853                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$37)
    6854                      .dwattr $C$DW$684, DW_AT_name("version")
    6855                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_version")
    6856                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6857                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6858              $C$DW$685       .dwtag  DW_TAG_member
    6859                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$39)
    6860                      .dwattr $C$DW$685, DW_AT_name("state")
    6861                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_state")
    6862                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6863                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6864              $C$DW$686       .dwtag  DW_TAG_member
    6865                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$39)
    6866                      .dwattr $C$DW$686, DW_AT_name("prevState")
    6867                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_prevState")
    6868                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6869                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6870              $C$DW$687       .dwtag  DW_TAG_member
    6871                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$41)
    6872                      .dwattr $C$DW$687, DW_AT_name("errorCode")
    6873                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_errorCode")
    6874                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6875                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6876              $C$DW$688       .dwtag  DW_TAG_member
    6877                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$43)
    6878                      .dwattr $C$DW$688, DW_AT_name("clarkeHandle_I")
    6879                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6880                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6881                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6882              $C$DW$689       .dwtag  DW_TAG_member
    6883                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$44)
    6884                      .dwattr $C$DW$689, DW_AT_name("clarke_I")
    6885                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_clarke_I")
    6886                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6887                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6888              $C$DW$690       .dwtag  DW_TAG_member
    6889                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$43)
    6890                      .dwattr $C$DW$690, DW_AT_name("clarkeHandle_V")
    6891                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6892                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6893                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6894              $C$DW$691       .dwtag  DW_TAG_member
    6895                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$44)
    6896                      .dwattr $C$DW$691, DW_AT_name("clarke_V")
    6897                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_clarke_V")
    6898                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  133

    6899                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6900              $C$DW$692       .dwtag  DW_TAG_member
    6901                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$46)
    6902                      .dwattr $C$DW$692, DW_AT_name("estHandle")
    6903                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_estHandle")
    6904                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6905                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6906              $C$DW$693       .dwtag  DW_TAG_member
    6907                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$48)
    6908                      .dwattr $C$DW$693, DW_AT_name("parkHandle")
    6909                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_parkHandle")
    6910                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6911                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6912              $C$DW$694       .dwtag  DW_TAG_member
    6913                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$49)
    6914                      .dwattr $C$DW$694, DW_AT_name("park")
    6915                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_park")
    6916                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6917                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6918              $C$DW$695       .dwtag  DW_TAG_member
    6919                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$51)
    6920                      .dwattr $C$DW$695, DW_AT_name("pidHandle_Id")
    6921                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_pidHandle_Id")
    6922                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6923                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6924              $C$DW$696       .dwtag  DW_TAG_member
    6925                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$52)
    6926                      .dwattr $C$DW$696, DW_AT_name("pid_Id")
    6927                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_pid_Id")
    6928                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6929                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6930              $C$DW$697       .dwtag  DW_TAG_member
    6931                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$51)
    6932                      .dwattr $C$DW$697, DW_AT_name("pidHandle_Iq")
    6933                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6934                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6935                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6936              $C$DW$698       .dwtag  DW_TAG_member
    6937                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$52)
    6938                      .dwattr $C$DW$698, DW_AT_name("pid_Iq")
    6939                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_pid_Iq")
    6940                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6941                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6942              $C$DW$699       .dwtag  DW_TAG_member
    6943                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$51)
    6944                      .dwattr $C$DW$699, DW_AT_name("pidHandle_spd")
    6945                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_pidHandle_spd")
    6946                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6947                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6948              $C$DW$700       .dwtag  DW_TAG_member
    6949                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$52)
    6950                      .dwattr $C$DW$700, DW_AT_name("pid_spd")
    6951                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_pid_spd")
    6952                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6953                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  134

    6954              $C$DW$701       .dwtag  DW_TAG_member
    6955                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$54)
    6956                      .dwattr $C$DW$701, DW_AT_name("iparkHandle")
    6957                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_iparkHandle")
    6958                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6959                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6960              $C$DW$702       .dwtag  DW_TAG_member
    6961                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$55)
    6962                      .dwattr $C$DW$702, DW_AT_name("ipark")
    6963                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ipark")
    6964                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6965                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6966              $C$DW$703       .dwtag  DW_TAG_member
    6967                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$57)
    6968                      .dwattr $C$DW$703, DW_AT_name("svgenHandle")
    6969                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_svgenHandle")
    6970                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6971                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6972              $C$DW$704       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$58)
    6974                      .dwattr $C$DW$704, DW_AT_name("svgen")
    6975                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_svgen")
    6976                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6977                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6978              $C$DW$705       .dwtag  DW_TAG_member
    6979                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$60)
    6980                      .dwattr $C$DW$705, DW_AT_name("trajHandle_Id")
    6981                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_trajHandle_Id")
    6982                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6983                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6984              $C$DW$706       .dwtag  DW_TAG_member
    6985                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$61)
    6986                      .dwattr $C$DW$706, DW_AT_name("traj_Id")
    6987                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_traj_Id")
    6988                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6989                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6990              $C$DW$707       .dwtag  DW_TAG_member
    6991                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$60)
    6992                      .dwattr $C$DW$707, DW_AT_name("trajHandle_spd")
    6993                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_trajHandle_spd")
    6994                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6995                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6996              $C$DW$708       .dwtag  DW_TAG_member
    6997                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$61)
    6998                      .dwattr $C$DW$708, DW_AT_name("traj_spd")
    6999                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_traj_spd")
    7000                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7001                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7002              $C$DW$709       .dwtag  DW_TAG_member
    7003                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$60)
    7004                      .dwattr $C$DW$709, DW_AT_name("trajHandle_spdMax")
    7005                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7006                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7007                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7008              $C$DW$710       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  135

    7009                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$61)
    7010                      .dwattr $C$DW$710, DW_AT_name("traj_spdMax")
    7011                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_traj_spdMax")
    7012                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7013                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7014              $C$DW$711       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$62)
    7016                      .dwattr $C$DW$711, DW_AT_name("motorParams")
    7017                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_motorParams")
    7018                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7019                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7020              $C$DW$712       .dwtag  DW_TAG_member
    7021                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$65)
    7022                      .dwattr $C$DW$712, DW_AT_name("waitTimes")
    7023                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_waitTimes")
    7024                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7025                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7026              $C$DW$713       .dwtag  DW_TAG_member
    7027                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$64)
    7028                      .dwattr $C$DW$713, DW_AT_name("counter_state")
    7029                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_counter_state")
    7030                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7031                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7032              $C$DW$714       .dwtag  DW_TAG_member
    7033                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$66)
    7034                      .dwattr $C$DW$714, DW_AT_name("numIsrTicksPerCtrlTick")
    7035                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7036                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7037                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7038              $C$DW$715       .dwtag  DW_TAG_member
    7039                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$66)
    7040                      .dwattr $C$DW$715, DW_AT_name("numCtrlTicksPerCurrentTick")
    7041                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7042                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7043                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7044              $C$DW$716       .dwtag  DW_TAG_member
    7045                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$66)
    7046                      .dwattr $C$DW$716, DW_AT_name("numCtrlTicksPerSpeedTick")
    7047                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7048                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7049                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7050              $C$DW$717       .dwtag  DW_TAG_member
    7051                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$66)
    7052                      .dwattr $C$DW$717, DW_AT_name("numCtrlTicksPerTrajTick")
    7053                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7054                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7055                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7056              $C$DW$718       .dwtag  DW_TAG_member
    7057                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$64)
    7058                      .dwattr $C$DW$718, DW_AT_name("ctrlFreq_Hz")
    7059                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7060                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7061                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7062              $C$DW$719       .dwtag  DW_TAG_member
    7063                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$64)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  136

    7064                      .dwattr $C$DW$719, DW_AT_name("trajFreq_Hz")
    7065                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7066                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7067                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7068              $C$DW$720       .dwtag  DW_TAG_member
    7069                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$31)
    7070                      .dwattr $C$DW$720, DW_AT_name("trajPeriod_sec")
    7071                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7072                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7073                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7074              $C$DW$721       .dwtag  DW_TAG_member
    7075                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$67)
    7076                      .dwattr $C$DW$721, DW_AT_name("ctrlPeriod_sec")
    7077                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7078                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7079                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7080              $C$DW$722       .dwtag  DW_TAG_member
    7081                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$31)
    7082                      .dwattr $C$DW$722, DW_AT_name("maxVsMag_pu")
    7083                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7084                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7085                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7086              $C$DW$723       .dwtag  DW_TAG_member
    7087                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$68)
    7088                      .dwattr $C$DW$723, DW_AT_name("Iab_in")
    7089                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_Iab_in")
    7090                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7091                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7092              $C$DW$724       .dwtag  DW_TAG_member
    7093                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$68)
    7094                      .dwattr $C$DW$724, DW_AT_name("Iab_filt")
    7095                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_Iab_filt")
    7096                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7097                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7098              $C$DW$725       .dwtag  DW_TAG_member
    7099                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$68)
    7100                      .dwattr $C$DW$725, DW_AT_name("Idq_in")
    7101                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_Idq_in")
    7102                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7103                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7104              $C$DW$726       .dwtag  DW_TAG_member
    7105                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$68)
    7106                      .dwattr $C$DW$726, DW_AT_name("Vab_in")
    7107                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Vab_in")
    7108                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7109                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7110              $C$DW$727       .dwtag  DW_TAG_member
    7111                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$31)
    7112                      .dwattr $C$DW$727, DW_AT_name("spd_out")
    7113                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_spd_out")
    7114                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7115                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7116              $C$DW$728       .dwtag  DW_TAG_member
    7117                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$68)
    7118                      .dwattr $C$DW$728, DW_AT_name("Vab_out")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  137

    7119                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_Vab_out")
    7120                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7121                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7122              $C$DW$729       .dwtag  DW_TAG_member
    7123                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$68)
    7124                      .dwattr $C$DW$729, DW_AT_name("Vdq_out")
    7125                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_Vdq_out")
    7126                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7127                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7128              $C$DW$730       .dwtag  DW_TAG_member
    7129                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$67)
    7130                      .dwattr $C$DW$730, DW_AT_name("Rhf")
    7131                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_Rhf")
    7132                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7133                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7134              $C$DW$731       .dwtag  DW_TAG_member
    7135                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$67)
    7136                      .dwattr $C$DW$731, DW_AT_name("Lhf")
    7137                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_Lhf")
    7138                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7139                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7140              $C$DW$732       .dwtag  DW_TAG_member
    7141                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$67)
    7142                      .dwattr $C$DW$732, DW_AT_name("RoverL")
    7143                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_RoverL")
    7144                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7145                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7146              $C$DW$733       .dwtag  DW_TAG_member
    7147                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$31)
    7148                      .dwattr $C$DW$733, DW_AT_name("Kp_Id")
    7149                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_Kp_Id")
    7150                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7151                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7152              $C$DW$734       .dwtag  DW_TAG_member
    7153                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$31)
    7154                      .dwattr $C$DW$734, DW_AT_name("Kp_Iq")
    7155                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Kp_Iq")
    7156                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7157                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7158              $C$DW$735       .dwtag  DW_TAG_member
    7159                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$31)
    7160                      .dwattr $C$DW$735, DW_AT_name("Kp_spd")
    7161                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_Kp_spd")
    7162                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7163                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7164              $C$DW$736       .dwtag  DW_TAG_member
    7165                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$31)
    7166                      .dwattr $C$DW$736, DW_AT_name("Ki_Id")
    7167                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_Ki_Id")
    7168                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7169                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7170              $C$DW$737       .dwtag  DW_TAG_member
    7171                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$31)
    7172                      .dwattr $C$DW$737, DW_AT_name("Ki_Iq")
    7173                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_Ki_Iq")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  138

    7174                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7175                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7176              $C$DW$738       .dwtag  DW_TAG_member
    7177                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$31)
    7178                      .dwattr $C$DW$738, DW_AT_name("Ki_spd")
    7179                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_Ki_spd")
    7180                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7181                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7182              $C$DW$739       .dwtag  DW_TAG_member
    7183                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$31)
    7184                      .dwattr $C$DW$739, DW_AT_name("Kd_Id")
    7185                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_Kd_Id")
    7186                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7187                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7188              $C$DW$740       .dwtag  DW_TAG_member
    7189                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$31)
    7190                      .dwattr $C$DW$740, DW_AT_name("Kd_Iq")
    7191                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_Kd_Iq")
    7192                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7193                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7194              $C$DW$741       .dwtag  DW_TAG_member
    7195                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$31)
    7196                      .dwattr $C$DW$741, DW_AT_name("Kd_spd")
    7197                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Kd_spd")
    7198                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7199                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7200              $C$DW$742       .dwtag  DW_TAG_member
    7201                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$31)
    7202                      .dwattr $C$DW$742, DW_AT_name("Ui_Id")
    7203                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Ui_Id")
    7204                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7205                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7206              $C$DW$743       .dwtag  DW_TAG_member
    7207                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$31)
    7208                      .dwattr $C$DW$743, DW_AT_name("Ui_Iq")
    7209                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Ui_Iq")
    7210                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7211                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7212              $C$DW$744       .dwtag  DW_TAG_member
    7213                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$31)
    7214                      .dwattr $C$DW$744, DW_AT_name("Ui_spd")
    7215                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Ui_spd")
    7216                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7217                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7218              $C$DW$745       .dwtag  DW_TAG_member
    7219                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$68)
    7220                      .dwattr $C$DW$745, DW_AT_name("Idq_ref")
    7221                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Idq_ref")
    7222                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7223                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7224              $C$DW$746       .dwtag  DW_TAG_member
    7225                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$31)
    7226                      .dwattr $C$DW$746, DW_AT_name("IdRated")
    7227                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_IdRated")
    7228                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  139

    7229                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7230              $C$DW$747       .dwtag  DW_TAG_member
    7231                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$31)
    7232                      .dwattr $C$DW$747, DW_AT_name("spd_ref")
    7233                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_spd_ref")
    7234                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7235                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7236              $C$DW$748       .dwtag  DW_TAG_member
    7237                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$31)
    7238                      .dwattr $C$DW$748, DW_AT_name("spd_max")
    7239                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_spd_max")
    7240                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7241                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7242              $C$DW$749       .dwtag  DW_TAG_member
    7243                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$66)
    7244                      .dwattr $C$DW$749, DW_AT_name("counter_current")
    7245                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_counter_current")
    7246                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7247                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7248              $C$DW$750       .dwtag  DW_TAG_member
    7249                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$66)
    7250                      .dwattr $C$DW$750, DW_AT_name("counter_isr")
    7251                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_counter_isr")
    7252                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7253                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7254              $C$DW$751       .dwtag  DW_TAG_member
    7255                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$66)
    7256                      .dwattr $C$DW$751, DW_AT_name("counter_speed")
    7257                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_counter_speed")
    7258                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7259                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7260              $C$DW$752       .dwtag  DW_TAG_member
    7261                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$66)
    7262                      .dwattr $C$DW$752, DW_AT_name("counter_traj")
    7263                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_counter_traj")
    7264                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7265                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7266              $C$DW$753       .dwtag  DW_TAG_member
    7267                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$69)
    7268                      .dwattr $C$DW$753, DW_AT_name("flag_enableCtrl")
    7269                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7270                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7271                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7272              $C$DW$754       .dwtag  DW_TAG_member
    7273                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$69)
    7274                      .dwattr $C$DW$754, DW_AT_name("flag_enableDcBusComp")
    7275                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7276                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7277                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7278              $C$DW$755       .dwtag  DW_TAG_member
    7279                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$69)
    7280                      .dwattr $C$DW$755, DW_AT_name("flag_enablePowerWarp")
    7281                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7282                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7283                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  140

    7284              $C$DW$756       .dwtag  DW_TAG_member
    7285                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$69)
    7286                      .dwattr $C$DW$756, DW_AT_name("flag_enableOffset")
    7287                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_flag_enableOffset")
    7288                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7289                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7290              $C$DW$757       .dwtag  DW_TAG_member
    7291                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$69)
    7292                      .dwattr $C$DW$757, DW_AT_name("flag_enableSpeedCtrl")
    7293                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7294                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7295                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7296              $C$DW$758       .dwtag  DW_TAG_member
    7297                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$69)
    7298                      .dwattr $C$DW$758, DW_AT_name("flag_enableUserMotorParams")
    7299                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7300                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7301                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7302              $C$DW$759       .dwtag  DW_TAG_member
    7303                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$68)
    7304                      .dwattr $C$DW$759, DW_AT_name("Idq_offset_pu")
    7305                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7306                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7307                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7308              $C$DW$760       .dwtag  DW_TAG_member
    7309                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$68)
    7310                      .dwattr $C$DW$760, DW_AT_name("Vdq_offset_pu")
    7311                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7312                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7313                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7314              $C$DW$761       .dwtag  DW_TAG_member
    7315                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$31)
    7316                      .dwattr $C$DW$761, DW_AT_name("angle_pu")
    7317                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_angle_pu")
    7318                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7319                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7320              $C$DW$762       .dwtag  DW_TAG_member
    7321                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$31)
    7322                      .dwattr $C$DW$762, DW_AT_name("speed_ref_pu")
    7323                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_speed_ref_pu")
    7324                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7325                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7326              $C$DW$763       .dwtag  DW_TAG_member
    7327                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$31)
    7328                      .dwattr $C$DW$763, DW_AT_name("speed_fb_pu")
    7329                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_speed_fb_pu")
    7330                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7331                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7332              $C$DW$764       .dwtag  DW_TAG_member
    7333                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$31)
    7334                      .dwattr $C$DW$764, DW_AT_name("speed_outMax_pu")
    7335                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7336                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7337                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7338              $C$DW$765       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  141

    7339                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$69)
    7340                      .dwattr $C$DW$765, DW_AT_name("flag_enableCurrentCtrl")
    7341                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7342                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7343                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7344                      .dwendtag $C$DW$T$70
    7345              
    7346              $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7347                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$70)
    7348                      .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    7349              $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    7350                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$70)
    7351                      .dwattr $C$DW$T$157, DW_AT_address_class(0x20)
    7352              $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7353                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$157)
    7354                      .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    7355              $C$DW$766       .dwtag  DW_TAG_TI_far_type
    7356                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$158)
    7357              $C$DW$T$172     .dwtag  DW_TAG_const_type
    7358                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$766)
    7359              
    7360              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7361                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    7362                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    7363              $C$DW$767       .dwtag  DW_TAG_member
    7364                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$22)
    7365                      .dwattr $C$DW$767, DW_AT_name("rsvd")
    7366                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_rsvd")
    7367                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7368                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7369              $C$DW$768       .dwtag  DW_TAG_member
    7370                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$72)
    7371                      .dwattr $C$DW$768, DW_AT_name("targetProc")
    7372                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_targetProc")
    7373                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7374                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7375              $C$DW$769       .dwtag  DW_TAG_member
    7376                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$22)
    7377                      .dwattr $C$DW$769, DW_AT_name("major")
    7378                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_major")
    7379                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7380                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7381              $C$DW$770       .dwtag  DW_TAG_member
    7382                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$22)
    7383                      .dwattr $C$DW$770, DW_AT_name("minor")
    7384                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_minor")
    7385                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7386                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7387                      .dwendtag $C$DW$T$73
    7388              
    7389              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7390                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    7391                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    7392              
    7393              $C$DW$T$19      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  142

    7394                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7395                      .dwattr $C$DW$T$19, DW_AT_declaration
    7396                      .dwendtag $C$DW$T$19
    7397              
    7398              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    7399                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
    7400                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    7401              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7402                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    7403                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    7404              
    7405              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7406                      .dwattr $C$DW$T$74, DW_AT_name("_FILTER_FO_")
    7407                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    7408              $C$DW$771       .dwtag  DW_TAG_member
    7409                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$31)
    7410                      .dwattr $C$DW$771, DW_AT_name("a1")
    7411                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_a1")
    7412                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7413                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7414              $C$DW$772       .dwtag  DW_TAG_member
    7415                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$31)
    7416                      .dwattr $C$DW$772, DW_AT_name("b0")
    7417                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_b0")
    7418                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7419                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7420              $C$DW$773       .dwtag  DW_TAG_member
    7421                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
    7422                      .dwattr $C$DW$773, DW_AT_name("b1")
    7423                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_b1")
    7424                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7425                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7426              $C$DW$774       .dwtag  DW_TAG_member
    7427                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    7428                      .dwattr $C$DW$774, DW_AT_name("x1")
    7429                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_x1")
    7430                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7431                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7432              $C$DW$775       .dwtag  DW_TAG_member
    7433                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$31)
    7434                      .dwattr $C$DW$775, DW_AT_name("y1")
    7435                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_y1")
    7436                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7437                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7438                      .dwendtag $C$DW$T$74
    7439              
    7440              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7441                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$74)
    7442                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    7443              $C$DW$T$174     .dwtag  DW_TAG_pointer_type
    7444                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$124)
    7445                      .dwattr $C$DW$T$174, DW_AT_address_class(0x20)
    7446              
    7447              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7448                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  143

    7449                      .dwattr $C$DW$T$20, DW_AT_declaration
    7450                      .dwendtag $C$DW$T$20
    7451              
    7452              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    7453                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$20)
    7454                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
    7455              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7456                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    7457                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    7458              
    7459              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    7460                      .dwattr $C$DW$T$75, DW_AT_name("_FLASH_Obj_")
    7461                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    7462              $C$DW$776       .dwtag  DW_TAG_member
    7463                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$23)
    7464                      .dwattr $C$DW$776, DW_AT_name("FOPT")
    7465                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_FOPT")
    7466                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7467                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7468              $C$DW$777       .dwtag  DW_TAG_member
    7469                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$23)
    7470                      .dwattr $C$DW$777, DW_AT_name("rsvd_1")
    7471                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_rsvd_1")
    7472                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7473                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7474              $C$DW$778       .dwtag  DW_TAG_member
    7475                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$23)
    7476                      .dwattr $C$DW$778, DW_AT_name("FPWR")
    7477                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_FPWR")
    7478                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7479                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7480              $C$DW$779       .dwtag  DW_TAG_member
    7481                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$23)
    7482                      .dwattr $C$DW$779, DW_AT_name("FSTATUS")
    7483                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_FSTATUS")
    7484                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7485                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7486              $C$DW$780       .dwtag  DW_TAG_member
    7487                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$23)
    7488                      .dwattr $C$DW$780, DW_AT_name("FSTDBYWAIT")
    7489                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7490                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7491                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7492              $C$DW$781       .dwtag  DW_TAG_member
    7493                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$23)
    7494                      .dwattr $C$DW$781, DW_AT_name("FACTIVEWAIT")
    7495                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7496                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7497                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7498              $C$DW$782       .dwtag  DW_TAG_member
    7499                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$23)
    7500                      .dwattr $C$DW$782, DW_AT_name("FBANKWAIT")
    7501                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_FBANKWAIT")
    7502                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7503                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  144

    7504              $C$DW$783       .dwtag  DW_TAG_member
    7505                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$23)
    7506                      .dwattr $C$DW$783, DW_AT_name("FOTPWAIT")
    7507                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_FOTPWAIT")
    7508                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7509                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7510                      .dwendtag $C$DW$T$75
    7511              
    7512              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    7513                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$75)
    7514                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    7515              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7516                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    7517                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    7518              
    7519              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7520                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
    7521                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
    7522              $C$DW$784       .dwtag  DW_TAG_member
    7523                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$76)
    7524                      .dwattr $C$DW$784, DW_AT_name("GPACTRL")
    7525                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_GPACTRL")
    7526                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7527                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7528              $C$DW$785       .dwtag  DW_TAG_member
    7529                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$76)
    7530                      .dwattr $C$DW$785, DW_AT_name("GPAQSEL1")
    7531                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_GPAQSEL1")
    7532                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7533                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7534              $C$DW$786       .dwtag  DW_TAG_member
    7535                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$76)
    7536                      .dwattr $C$DW$786, DW_AT_name("GPAQSEL2")
    7537                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_GPAQSEL2")
    7538                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7539                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7540              $C$DW$787       .dwtag  DW_TAG_member
    7541                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$76)
    7542                      .dwattr $C$DW$787, DW_AT_name("GPAMUX1")
    7543                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_GPAMUX1")
    7544                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7545                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7546              $C$DW$788       .dwtag  DW_TAG_member
    7547                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$76)
    7548                      .dwattr $C$DW$788, DW_AT_name("GPAMUX2")
    7549                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_GPAMUX2")
    7550                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7551                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7552              $C$DW$789       .dwtag  DW_TAG_member
    7553                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$76)
    7554                      .dwattr $C$DW$789, DW_AT_name("GPADIR")
    7555                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_GPADIR")
    7556                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7557                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7558              $C$DW$790       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  145

    7559                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$76)
    7560                      .dwattr $C$DW$790, DW_AT_name("GPAPUD")
    7561                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_GPAPUD")
    7562                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7563                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7564              $C$DW$791       .dwtag  DW_TAG_member
    7565                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$26)
    7566                      .dwattr $C$DW$791, DW_AT_name("rsvd_1")
    7567                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_rsvd_1")
    7568                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7569                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7570              $C$DW$792       .dwtag  DW_TAG_member
    7571                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$76)
    7572                      .dwattr $C$DW$792, DW_AT_name("GPBCTRL")
    7573                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_GPBCTRL")
    7574                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7575                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7576              $C$DW$793       .dwtag  DW_TAG_member
    7577                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$76)
    7578                      .dwattr $C$DW$793, DW_AT_name("GPBQSEL1")
    7579                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_GPBQSEL1")
    7580                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7581                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7582              $C$DW$794       .dwtag  DW_TAG_member
    7583                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$26)
    7584                      .dwattr $C$DW$794, DW_AT_name("rsvd_2")
    7585                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_rsvd_2")
    7586                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7587                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7588              $C$DW$795       .dwtag  DW_TAG_member
    7589                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$76)
    7590                      .dwattr $C$DW$795, DW_AT_name("GPBMUX1")
    7591                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_GPBMUX1")
    7592                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7593                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7594              $C$DW$796       .dwtag  DW_TAG_member
    7595                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$26)
    7596                      .dwattr $C$DW$796, DW_AT_name("rsvd_3")
    7597                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_rsvd_3")
    7598                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7599                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7600              $C$DW$797       .dwtag  DW_TAG_member
    7601                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$76)
    7602                      .dwattr $C$DW$797, DW_AT_name("GPBDIR")
    7603                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_GPBDIR")
    7604                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7605                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7606              $C$DW$798       .dwtag  DW_TAG_member
    7607                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$76)
    7608                      .dwattr $C$DW$798, DW_AT_name("GPBPUD")
    7609                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_GPBPUD")
    7610                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7611                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7612              $C$DW$799       .dwtag  DW_TAG_member
    7613                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$77)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:51 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5710010                          PAGE  146

    7614                      .dwattr $C$DW$799, DW_AT_name("rsvd_4")
    7615                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_rsvd_4")
    7616                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7617                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7618              $C$DW$800       .dwtag  DW_TAG_member
    7619                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$76)
    7620                      .dwattr $C$DW$800, DW_AT_name("AIOMUX1")
    7621                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_AIOMUX1")
    7622                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7623                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7624              $C$DW$801       .dwtag  DW_TAG_member
    7625                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$26)
    7626                      .dwattr $C$DW$801, DW_AT_name("rsvd_5")
    7627                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_rsvd_5")
    7628                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7629                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7630              $C$DW$802       .dwtag  DW_TAG_member
    7631                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$76)
    7632                      .dwattr $C$DW$802, DW_AT_name("AIODIR")
    7633                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_AIODIR")
    7634                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7635                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7636              $C$DW$803       .dwtag  DW_TAG_member
    7637                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$78)
    7638                      .dwattr $C$DW$803, DW_AT_name("rsvd_6")
    7639                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_rsvd_6")
    7640                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7641                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7642              $C$DW$804       .dwtag  DW_TAG_member
    7643                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$76)
    7644                      .dwattr $C$DW$804, DW_AT_name("GPADAT")
    7645                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_GPADAT")
    7646                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7647                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7648              $C$DW$805       .dwtag  DW_TAG_member
    7649                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$76)
    7650                      .dwattr $C$DW$805, DW_AT_name("GPASET")
    7651                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_GPASET")
    7652                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7653                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7654              $C$DW$806       .dwtag  DW_TAG_member
    7655                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$76)
    7656                      .dwattr $C$DW$806, DW_AT_name("GPACLEAR")
    7657                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_GPACLEAR")
    7658                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7659                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7660              $C$DW$807       .dwtag  DW_TAG_member
    7661                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$76)
    7662                      .dwattr $C$DW$807, DW_AT_name("GPATOGGLE")
    7663                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_GPATOGGLE")
    7664                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7665                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7666              $C$DW$808       .dwtag  DW_TAG_member
    7667                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$76)
    7668                      .dwattr $C$DW$808, DW_AT_name("GPBDAT")
