TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.9 *
       3              ;* Date/Time created: Wed Dec 02 17:22:53 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/modules/hal/boards/hvkit_rev1p1
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.9 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_15\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIO_setLow")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_setLow")

    8047              $C$DW$1449      .dwtag  DW_TAG_enumerator, DW_AT_name("PLL_ClkFreq_60_MHz"), DW_AT_const_value(0x0c)
    8048                      .dwendtag $C$DW$T$245
    8049              
    8050              $C$DW$T$246     .dwtag  DW_TAG_typedef, DW_AT_name("PLL_ClkFreq_e")
    8051                      .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$245)
    8052                      .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    8053              $C$DW$1450      .dwtag  DW_TAG_TI_far_type
    8054                      .dwattr $C$DW$1450, DW_AT_type(*$C$DW$T$246)
    8055              $C$DW$T$247     .dwtag  DW_TAG_const_type
    8056                      .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$1450)
    8057              
    8058              $C$DW$T$251     .dwtag  DW_TAG_enumeration_type
    8059                      .dwattr $C$DW$T$251, DW_AT_byte_size(0x01)
    8060              $C$DW$1451      .dwtag  DW_TAG_enumerator, DW_AT_name("PLL_ClkStatus_Normal"), DW_AT_const_value(0x00)
    8061              $C$DW$1452      .dwtag  DW_TAG_enumerator, DW_AT_name("PLL_ClkStatus_Missing"), DW_AT_const_value(0x08)
    8062                      .dwendtag $C$DW$T$251
    8063              
    8064              $C$DW$T$252     .dwtag  DW_TAG_typedef, DW_AT_name("PLL_ClkStatus_e")
    8065                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
    8066                      .dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
    8067              
    8068              $C$DW$T$256     .dwtag  DW_TAG_enumeration_type
    8069                      .dwattr $C$DW$T$256, DW_AT_byte_size(0x01)
    8070              $C$DW$1453      .dwtag  DW_TAG_enumerator, DW_AT_name("PLL_DivideSelect_ClkIn_by_4"), DW_AT_const_value(0x00)
    8071              $C$DW$1454      .dwtag  DW_TAG_enumerator, DW_AT_name("PLL_DivideSelect_ClkIn_by_2"), DW_AT_const_value(0x100
    8072              $C$DW$1455      .dwtag  DW_TAG_enumerator, DW_AT_name("PLL_DivideSelect_ClkIn_by_1"), DW_AT_const_value(0x180
    8073                      .dwendtag $C$DW$T$256
    8074              
    8075              $C$DW$T$257     .dwtag  DW_TAG_typedef, DW_AT_name("PLL_DivideSelect_e")
    8076                      .dwattr $C$DW$T$257, DW_AT_type(*$C$DW$T$256)
    8077                      .dwattr $C$DW$T$257, DW_AT_language(DW_LANG_C)
    8078              $C$DW$1456      .dwtag  DW_TAG_TI_far_type
    8079                      .dwattr $C$DW$1456, DW_AT_type(*$C$DW$T$257)
    8080              $C$DW$T$258     .dwtag  DW_TAG_const_type
    8081                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$1456)
    8082              
    8083              $C$DW$T$262     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  156

    8084                      .dwattr $C$DW$T$262, DW_AT_byte_size(0x01)
    8085              $C$DW$1457      .dwtag  DW_TAG_enumerator, DW_AT_name("PLL_LockStatus_Locking"), DW_AT_const_value(0x00)
    8086              $C$DW$1458      .dwtag  DW_TAG_enumerator, DW_AT_name("PLL_LockStatus_Done"), DW_AT_const_value(0x01)
    8087                      .dwendtag $C$DW$T$262
    8088              
    8089              $C$DW$T$263     .dwtag  DW_TAG_typedef, DW_AT_name("PLL_LockStatus_e")
    8090                      .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
    8091                      .dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
    8092              
    8093              $C$DW$T$267     .dwtag  DW_TAG_enumeration_type
    8094                      .dwattr $C$DW$T$267, DW_AT_byte_size(0x01)
    8095              $C$DW$1459      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
    8096              $C$DW$1460      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
    8097              $C$DW$1461      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
    8098                      .dwendtag $C$DW$T$267
    8099              
    8100              $C$DW$T$268     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
    8101                      .dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$267)
    8102                      .dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
    8103              $C$DW$1462      .dwtag  DW_TAG_TI_far_type
    8104                      .dwattr $C$DW$1462, DW_AT_type(*$C$DW$T$268)
    8105              $C$DW$T$269     .dwtag  DW_TAG_const_type
    8106                      .dwattr $C$DW$T$269, DW_AT_type(*$C$DW$1462)
    8107              
    8108              $C$DW$T$270     .dwtag  DW_TAG_enumeration_type
    8109                      .dwattr $C$DW$T$270, DW_AT_byte_size(0x01)
    8110              $C$DW$1463      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    8111              $C$DW$1464      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    8112                      .dwendtag $C$DW$T$270
    8113              
    8114              $C$DW$T$271     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    8115                      .dwattr $C$DW$T$271, DW_AT_type(*$C$DW$T$270)
    8116                      .dwattr $C$DW$T$271, DW_AT_language(DW_LANG_C)
    8117              
    8118              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    8119                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    8120                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    8121              $C$DW$1465      .dwtag  DW_TAG_member
    8122                      .dwattr $C$DW$1465, DW_AT_type(*$C$DW$T$23)
    8123                      .dwattr $C$DW$1465, DW_AT_name("ADCRESULT")
    8124                      .dwattr $C$DW$1465, DW_AT_TI_symbol_name("_ADCRESULT")
    8125                      .dwattr $C$DW$1465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8126                      .dwattr $C$DW$1465, DW_AT_accessibility(DW_ACCESS_public)
    8127              $C$DW$1466      .dwtag  DW_TAG_member
    8128                      .dwattr $C$DW$1466, DW_AT_type(*$C$DW$T$24)
    8129                      .dwattr $C$DW$1466, DW_AT_name("resvd_1")
    8130                      .dwattr $C$DW$1466, DW_AT_TI_symbol_name("_resvd_1")
    8131                      .dwattr $C$DW$1466, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8132                      .dwattr $C$DW$1466, DW_AT_accessibility(DW_ACCESS_public)
    8133              $C$DW$1467      .dwtag  DW_TAG_member
    8134                      .dwattr $C$DW$1467, DW_AT_type(*$C$DW$T$22)
    8135                      .dwattr $C$DW$1467, DW_AT_name("ADCCTL1")
    8136                      .dwattr $C$DW$1467, DW_AT_TI_symbol_name("_ADCCTL1")
    8137                      .dwattr $C$DW$1467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8138                      .dwattr $C$DW$1467, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  157

    8139              $C$DW$1468      .dwtag  DW_TAG_member
    8140                      .dwattr $C$DW$1468, DW_AT_type(*$C$DW$T$22)
    8141                      .dwattr $C$DW$1468, DW_AT_name("ADCCTL2")
    8142                      .dwattr $C$DW$1468, DW_AT_TI_symbol_name("_ADCCTL2")
    8143                      .dwattr $C$DW$1468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8144                      .dwattr $C$DW$1468, DW_AT_accessibility(DW_ACCESS_public)
    8145              $C$DW$1469      .dwtag  DW_TAG_member
    8146                      .dwattr $C$DW$1469, DW_AT_type(*$C$DW$T$25)
    8147                      .dwattr $C$DW$1469, DW_AT_name("rsvd_2")
    8148                      .dwattr $C$DW$1469, DW_AT_TI_symbol_name("_rsvd_2")
    8149                      .dwattr $C$DW$1469, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8150                      .dwattr $C$DW$1469, DW_AT_accessibility(DW_ACCESS_public)
    8151              $C$DW$1470      .dwtag  DW_TAG_member
    8152                      .dwattr $C$DW$1470, DW_AT_type(*$C$DW$T$22)
    8153                      .dwattr $C$DW$1470, DW_AT_name("ADCINTFLG")
    8154                      .dwattr $C$DW$1470, DW_AT_TI_symbol_name("_ADCINTFLG")
    8155                      .dwattr $C$DW$1470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8156                      .dwattr $C$DW$1470, DW_AT_accessibility(DW_ACCESS_public)
    8157              $C$DW$1471      .dwtag  DW_TAG_member
    8158                      .dwattr $C$DW$1471, DW_AT_type(*$C$DW$T$22)
    8159                      .dwattr $C$DW$1471, DW_AT_name("ADCINTFLGCLR")
    8160                      .dwattr $C$DW$1471, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8161                      .dwattr $C$DW$1471, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8162                      .dwattr $C$DW$1471, DW_AT_accessibility(DW_ACCESS_public)
    8163              $C$DW$1472      .dwtag  DW_TAG_member
    8164                      .dwattr $C$DW$1472, DW_AT_type(*$C$DW$T$22)
    8165                      .dwattr $C$DW$1472, DW_AT_name("ADCINTOVF")
    8166                      .dwattr $C$DW$1472, DW_AT_TI_symbol_name("_ADCINTOVF")
    8167                      .dwattr $C$DW$1472, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8168                      .dwattr $C$DW$1472, DW_AT_accessibility(DW_ACCESS_public)
    8169              $C$DW$1473      .dwtag  DW_TAG_member
    8170                      .dwattr $C$DW$1473, DW_AT_type(*$C$DW$T$22)
    8171                      .dwattr $C$DW$1473, DW_AT_name("ADCINTOVFCLR")
    8172                      .dwattr $C$DW$1473, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8173                      .dwattr $C$DW$1473, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8174                      .dwattr $C$DW$1473, DW_AT_accessibility(DW_ACCESS_public)
    8175              $C$DW$1474      .dwtag  DW_TAG_member
    8176                      .dwattr $C$DW$1474, DW_AT_type(*$C$DW$T$26)
    8177                      .dwattr $C$DW$1474, DW_AT_name("INTSELxNy")
    8178                      .dwattr $C$DW$1474, DW_AT_TI_symbol_name("_INTSELxNy")
    8179                      .dwattr $C$DW$1474, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8180                      .dwattr $C$DW$1474, DW_AT_accessibility(DW_ACCESS_public)
    8181              $C$DW$1475      .dwtag  DW_TAG_member
    8182                      .dwattr $C$DW$1475, DW_AT_type(*$C$DW$T$27)
    8183                      .dwattr $C$DW$1475, DW_AT_name("rsvd_3")
    8184                      .dwattr $C$DW$1475, DW_AT_TI_symbol_name("_rsvd_3")
    8185                      .dwattr $C$DW$1475, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8186                      .dwattr $C$DW$1475, DW_AT_accessibility(DW_ACCESS_public)
    8187              $C$DW$1476      .dwtag  DW_TAG_member
    8188                      .dwattr $C$DW$1476, DW_AT_type(*$C$DW$T$22)
    8189                      .dwattr $C$DW$1476, DW_AT_name("SOCPRICTRL")
    8190                      .dwattr $C$DW$1476, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8191                      .dwattr $C$DW$1476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8192                      .dwattr $C$DW$1476, DW_AT_accessibility(DW_ACCESS_public)
    8193              $C$DW$1477      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  158

    8194                      .dwattr $C$DW$1477, DW_AT_type(*$C$DW$T$22)
    8195                      .dwattr $C$DW$1477, DW_AT_name("rsvd_4")
    8196                      .dwattr $C$DW$1477, DW_AT_TI_symbol_name("_rsvd_4")
    8197                      .dwattr $C$DW$1477, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8198                      .dwattr $C$DW$1477, DW_AT_accessibility(DW_ACCESS_public)
    8199              $C$DW$1478      .dwtag  DW_TAG_member
    8200                      .dwattr $C$DW$1478, DW_AT_type(*$C$DW$T$22)
    8201                      .dwattr $C$DW$1478, DW_AT_name("ADCSAMPLEMODE")
    8202                      .dwattr $C$DW$1478, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8203                      .dwattr $C$DW$1478, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8204                      .dwattr $C$DW$1478, DW_AT_accessibility(DW_ACCESS_public)
    8205              $C$DW$1479      .dwtag  DW_TAG_member
    8206                      .dwattr $C$DW$1479, DW_AT_type(*$C$DW$T$22)
    8207                      .dwattr $C$DW$1479, DW_AT_name("rsvd_5")
    8208                      .dwattr $C$DW$1479, DW_AT_TI_symbol_name("_rsvd_5")
    8209                      .dwattr $C$DW$1479, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8210                      .dwattr $C$DW$1479, DW_AT_accessibility(DW_ACCESS_public)
    8211              $C$DW$1480      .dwtag  DW_TAG_member
    8212                      .dwattr $C$DW$1480, DW_AT_type(*$C$DW$T$22)
    8213                      .dwattr $C$DW$1480, DW_AT_name("ADCINTSOCSEL1")
    8214                      .dwattr $C$DW$1480, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8215                      .dwattr $C$DW$1480, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8216                      .dwattr $C$DW$1480, DW_AT_accessibility(DW_ACCESS_public)
    8217              $C$DW$1481      .dwtag  DW_TAG_member
    8218                      .dwattr $C$DW$1481, DW_AT_type(*$C$DW$T$22)
    8219                      .dwattr $C$DW$1481, DW_AT_name("ADCINTSOCSEL2")
    8220                      .dwattr $C$DW$1481, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8221                      .dwattr $C$DW$1481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8222                      .dwattr $C$DW$1481, DW_AT_accessibility(DW_ACCESS_public)
    8223              $C$DW$1482      .dwtag  DW_TAG_member
    8224                      .dwattr $C$DW$1482, DW_AT_type(*$C$DW$T$25)
    8225                      .dwattr $C$DW$1482, DW_AT_name("rsvd_6")
    8226                      .dwattr $C$DW$1482, DW_AT_TI_symbol_name("_rsvd_6")
    8227                      .dwattr $C$DW$1482, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8228                      .dwattr $C$DW$1482, DW_AT_accessibility(DW_ACCESS_public)
    8229              $C$DW$1483      .dwtag  DW_TAG_member
    8230                      .dwattr $C$DW$1483, DW_AT_type(*$C$DW$T$22)
    8231                      .dwattr $C$DW$1483, DW_AT_name("ADCSOCFLG1")
    8232                      .dwattr $C$DW$1483, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8233                      .dwattr $C$DW$1483, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8234                      .dwattr $C$DW$1483, DW_AT_accessibility(DW_ACCESS_public)
    8235              $C$DW$1484      .dwtag  DW_TAG_member
    8236                      .dwattr $C$DW$1484, DW_AT_type(*$C$DW$T$22)
    8237                      .dwattr $C$DW$1484, DW_AT_name("rsvd_7")
    8238                      .dwattr $C$DW$1484, DW_AT_TI_symbol_name("_rsvd_7")
    8239                      .dwattr $C$DW$1484, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8240                      .dwattr $C$DW$1484, DW_AT_accessibility(DW_ACCESS_public)
    8241              $C$DW$1485      .dwtag  DW_TAG_member
    8242                      .dwattr $C$DW$1485, DW_AT_type(*$C$DW$T$22)
    8243                      .dwattr $C$DW$1485, DW_AT_name("ADCSOCFRC1")
    8244                      .dwattr $C$DW$1485, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8245                      .dwattr $C$DW$1485, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8246                      .dwattr $C$DW$1485, DW_AT_accessibility(DW_ACCESS_public)
    8247              $C$DW$1486      .dwtag  DW_TAG_member
    8248                      .dwattr $C$DW$1486, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  159

    8249                      .dwattr $C$DW$1486, DW_AT_name("rsvd_8")
    8250                      .dwattr $C$DW$1486, DW_AT_TI_symbol_name("_rsvd_8")
    8251                      .dwattr $C$DW$1486, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8252                      .dwattr $C$DW$1486, DW_AT_accessibility(DW_ACCESS_public)
    8253              $C$DW$1487      .dwtag  DW_TAG_member
    8254                      .dwattr $C$DW$1487, DW_AT_type(*$C$DW$T$22)
    8255                      .dwattr $C$DW$1487, DW_AT_name("ADCSOCOVF1")
    8256                      .dwattr $C$DW$1487, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8257                      .dwattr $C$DW$1487, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8258                      .dwattr $C$DW$1487, DW_AT_accessibility(DW_ACCESS_public)
    8259              $C$DW$1488      .dwtag  DW_TAG_member
    8260                      .dwattr $C$DW$1488, DW_AT_type(*$C$DW$T$22)
    8261                      .dwattr $C$DW$1488, DW_AT_name("rsvd_9")
    8262                      .dwattr $C$DW$1488, DW_AT_TI_symbol_name("_rsvd_9")
    8263                      .dwattr $C$DW$1488, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8264                      .dwattr $C$DW$1488, DW_AT_accessibility(DW_ACCESS_public)
    8265              $C$DW$1489      .dwtag  DW_TAG_member
    8266                      .dwattr $C$DW$1489, DW_AT_type(*$C$DW$T$22)
    8267                      .dwattr $C$DW$1489, DW_AT_name("ADCSOCOVFCLR1")
    8268                      .dwattr $C$DW$1489, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8269                      .dwattr $C$DW$1489, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8270                      .dwattr $C$DW$1489, DW_AT_accessibility(DW_ACCESS_public)
    8271              $C$DW$1490      .dwtag  DW_TAG_member
    8272                      .dwattr $C$DW$1490, DW_AT_type(*$C$DW$T$22)
    8273                      .dwattr $C$DW$1490, DW_AT_name("rsvd_10")
    8274                      .dwattr $C$DW$1490, DW_AT_TI_symbol_name("_rsvd_10")
    8275                      .dwattr $C$DW$1490, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8276                      .dwattr $C$DW$1490, DW_AT_accessibility(DW_ACCESS_public)
    8277              $C$DW$1491      .dwtag  DW_TAG_member
    8278                      .dwattr $C$DW$1491, DW_AT_type(*$C$DW$T$23)
    8279                      .dwattr $C$DW$1491, DW_AT_name("ADCSOCxCTL")
    8280                      .dwattr $C$DW$1491, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8281                      .dwattr $C$DW$1491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8282                      .dwattr $C$DW$1491, DW_AT_accessibility(DW_ACCESS_public)
    8283              $C$DW$1492      .dwtag  DW_TAG_member
    8284                      .dwattr $C$DW$1492, DW_AT_type(*$C$DW$T$23)
    8285                      .dwattr $C$DW$1492, DW_AT_name("rsvd_11")
    8286                      .dwattr $C$DW$1492, DW_AT_TI_symbol_name("_rsvd_11")
    8287                      .dwattr $C$DW$1492, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8288                      .dwattr $C$DW$1492, DW_AT_accessibility(DW_ACCESS_public)
    8289              $C$DW$1493      .dwtag  DW_TAG_member
    8290                      .dwattr $C$DW$1493, DW_AT_type(*$C$DW$T$22)
    8291                      .dwattr $C$DW$1493, DW_AT_name("ADCREFTRIM")
    8292                      .dwattr $C$DW$1493, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8293                      .dwattr $C$DW$1493, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8294                      .dwattr $C$DW$1493, DW_AT_accessibility(DW_ACCESS_public)
    8295              $C$DW$1494      .dwtag  DW_TAG_member
    8296                      .dwattr $C$DW$1494, DW_AT_type(*$C$DW$T$22)
    8297                      .dwattr $C$DW$1494, DW_AT_name("ADCOFFTRIM")
    8298                      .dwattr $C$DW$1494, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8299                      .dwattr $C$DW$1494, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8300                      .dwattr $C$DW$1494, DW_AT_accessibility(DW_ACCESS_public)
    8301              $C$DW$1495      .dwtag  DW_TAG_member
    8302                      .dwattr $C$DW$1495, DW_AT_type(*$C$DW$T$28)
    8303                      .dwattr $C$DW$1495, DW_AT_name("resvd_12")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  160

    8304                      .dwattr $C$DW$1495, DW_AT_TI_symbol_name("_resvd_12")
    8305                      .dwattr $C$DW$1495, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8306                      .dwattr $C$DW$1495, DW_AT_accessibility(DW_ACCESS_public)
    8307              $C$DW$1496      .dwtag  DW_TAG_member
    8308                      .dwattr $C$DW$1496, DW_AT_type(*$C$DW$T$22)
    8309                      .dwattr $C$DW$1496, DW_AT_name("ADCREV")
    8310                      .dwattr $C$DW$1496, DW_AT_TI_symbol_name("_ADCREV")
    8311                      .dwattr $C$DW$1496, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8312                      .dwattr $C$DW$1496, DW_AT_accessibility(DW_ACCESS_public)
    8313                      .dwendtag $C$DW$T$29
    8314              
    8315              $C$DW$T$273     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    8316                      .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$29)
    8317                      .dwattr $C$DW$T$273, DW_AT_language(DW_LANG_C)
    8318              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    8319                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$29)
    8320                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    8321              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    8322                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    8323                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    8324              
    8325              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    8326                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    8327                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    8328              $C$DW$1497      .dwtag  DW_TAG_member
    8329                      .dwattr $C$DW$1497, DW_AT_type(*$C$DW$T$22)
    8330                      .dwattr $C$DW$1497, DW_AT_name("XCLK")
    8331                      .dwattr $C$DW$1497, DW_AT_TI_symbol_name("_XCLK")
    8332                      .dwattr $C$DW$1497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8333                      .dwattr $C$DW$1497, DW_AT_accessibility(DW_ACCESS_public)
    8334              $C$DW$1498      .dwtag  DW_TAG_member
    8335                      .dwattr $C$DW$1498, DW_AT_type(*$C$DW$T$22)
    8336                      .dwattr $C$DW$1498, DW_AT_name("rsvd_1")
    8337                      .dwattr $C$DW$1498, DW_AT_TI_symbol_name("_rsvd_1")
    8338                      .dwattr $C$DW$1498, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8339                      .dwattr $C$DW$1498, DW_AT_accessibility(DW_ACCESS_public)
    8340              $C$DW$1499      .dwtag  DW_TAG_member
    8341                      .dwattr $C$DW$1499, DW_AT_type(*$C$DW$T$22)
    8342                      .dwattr $C$DW$1499, DW_AT_name("CLKCTL")
    8343                      .dwattr $C$DW$1499, DW_AT_TI_symbol_name("_CLKCTL")
    8344                      .dwattr $C$DW$1499, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8345                      .dwattr $C$DW$1499, DW_AT_accessibility(DW_ACCESS_public)
    8346              $C$DW$1500      .dwtag  DW_TAG_member
    8347                      .dwattr $C$DW$1500, DW_AT_type(*$C$DW$T$30)
    8348                      .dwattr $C$DW$1500, DW_AT_name("rsvd_2")
    8349                      .dwattr $C$DW$1500, DW_AT_TI_symbol_name("_rsvd_2")
    8350                      .dwattr $C$DW$1500, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8351                      .dwattr $C$DW$1500, DW_AT_accessibility(DW_ACCESS_public)
    8352              $C$DW$1501      .dwtag  DW_TAG_member
    8353                      .dwattr $C$DW$1501, DW_AT_type(*$C$DW$T$22)
    8354                      .dwattr $C$DW$1501, DW_AT_name("LOSPCP")
    8355                      .dwattr $C$DW$1501, DW_AT_TI_symbol_name("_LOSPCP")
    8356                      .dwattr $C$DW$1501, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8357                      .dwattr $C$DW$1501, DW_AT_accessibility(DW_ACCESS_public)
    8358              $C$DW$1502      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  161

    8359                      .dwattr $C$DW$1502, DW_AT_type(*$C$DW$T$22)
    8360                      .dwattr $C$DW$1502, DW_AT_name("PCLKCR0")
    8361                      .dwattr $C$DW$1502, DW_AT_TI_symbol_name("_PCLKCR0")
    8362                      .dwattr $C$DW$1502, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8363                      .dwattr $C$DW$1502, DW_AT_accessibility(DW_ACCESS_public)
    8364              $C$DW$1503      .dwtag  DW_TAG_member
    8365                      .dwattr $C$DW$1503, DW_AT_type(*$C$DW$T$22)
    8366                      .dwattr $C$DW$1503, DW_AT_name("PCLKCR1")
    8367                      .dwattr $C$DW$1503, DW_AT_TI_symbol_name("_PCLKCR1")
    8368                      .dwattr $C$DW$1503, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8369                      .dwattr $C$DW$1503, DW_AT_accessibility(DW_ACCESS_public)
    8370              $C$DW$1504      .dwtag  DW_TAG_member
    8371                      .dwattr $C$DW$1504, DW_AT_type(*$C$DW$T$25)
    8372                      .dwattr $C$DW$1504, DW_AT_name("rsvd_3")
    8373                      .dwattr $C$DW$1504, DW_AT_TI_symbol_name("_rsvd_3")
    8374                      .dwattr $C$DW$1504, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8375                      .dwattr $C$DW$1504, DW_AT_accessibility(DW_ACCESS_public)
    8376              $C$DW$1505      .dwtag  DW_TAG_member
    8377                      .dwattr $C$DW$1505, DW_AT_type(*$C$DW$T$22)
    8378                      .dwattr $C$DW$1505, DW_AT_name("PCLKCR3")
    8379                      .dwattr $C$DW$1505, DW_AT_TI_symbol_name("_PCLKCR3")
    8380                      .dwattr $C$DW$1505, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8381                      .dwattr $C$DW$1505, DW_AT_accessibility(DW_ACCESS_public)
    8382                      .dwendtag $C$DW$T$31
    8383              
    8384              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    8385                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$31)
    8386                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    8387              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    8388                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    8389                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    8390              
    8391              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8392                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    8393                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    8394              $C$DW$1506      .dwtag  DW_TAG_member
    8395                      .dwattr $C$DW$1506, DW_AT_type(*$C$DW$T$32)
    8396                      .dwattr $C$DW$1506, DW_AT_name("tmp")
    8397                      .dwattr $C$DW$1506, DW_AT_TI_symbol_name("_tmp")
    8398                      .dwattr $C$DW$1506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8399                      .dwattr $C$DW$1506, DW_AT_accessibility(DW_ACCESS_public)
    8400                      .dwendtag $C$DW$T$33
    8401              
    8402              $C$DW$T$282     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
    8403                      .dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$33)
    8404                      .dwattr $C$DW$T$282, DW_AT_language(DW_LANG_C)
    8405              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    8406                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$33)
    8407                      .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    8408              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    8409                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    8410                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8411              
    8412              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8413                      .dwattr $C$DW$T$35, DW_AT_name("_FILTER_FO_")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  162

    8414                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
    8415              $C$DW$1507      .dwtag  DW_TAG_member
    8416                      .dwattr $C$DW$1507, DW_AT_type(*$C$DW$T$34)
    8417                      .dwattr $C$DW$1507, DW_AT_name("a1")
    8418                      .dwattr $C$DW$1507, DW_AT_TI_symbol_name("_a1")
    8419                      .dwattr $C$DW$1507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8420                      .dwattr $C$DW$1507, DW_AT_accessibility(DW_ACCESS_public)
    8421              $C$DW$1508      .dwtag  DW_TAG_member
    8422                      .dwattr $C$DW$1508, DW_AT_type(*$C$DW$T$34)
    8423                      .dwattr $C$DW$1508, DW_AT_name("b0")
    8424                      .dwattr $C$DW$1508, DW_AT_TI_symbol_name("_b0")
    8425                      .dwattr $C$DW$1508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8426                      .dwattr $C$DW$1508, DW_AT_accessibility(DW_ACCESS_public)
    8427              $C$DW$1509      .dwtag  DW_TAG_member
    8428                      .dwattr $C$DW$1509, DW_AT_type(*$C$DW$T$34)
    8429                      .dwattr $C$DW$1509, DW_AT_name("b1")
    8430                      .dwattr $C$DW$1509, DW_AT_TI_symbol_name("_b1")
    8431                      .dwattr $C$DW$1509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8432                      .dwattr $C$DW$1509, DW_AT_accessibility(DW_ACCESS_public)
    8433              $C$DW$1510      .dwtag  DW_TAG_member
    8434                      .dwattr $C$DW$1510, DW_AT_type(*$C$DW$T$34)
    8435                      .dwattr $C$DW$1510, DW_AT_name("x1")
    8436                      .dwattr $C$DW$1510, DW_AT_TI_symbol_name("_x1")
    8437                      .dwattr $C$DW$1510, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8438                      .dwattr $C$DW$1510, DW_AT_accessibility(DW_ACCESS_public)
    8439              $C$DW$1511      .dwtag  DW_TAG_member
    8440                      .dwattr $C$DW$1511, DW_AT_type(*$C$DW$T$34)
    8441                      .dwattr $C$DW$1511, DW_AT_name("y1")
    8442                      .dwattr $C$DW$1511, DW_AT_TI_symbol_name("_y1")
    8443                      .dwattr $C$DW$1511, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8444                      .dwattr $C$DW$1511, DW_AT_accessibility(DW_ACCESS_public)
    8445                      .dwendtag $C$DW$T$35
    8446              
    8447              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    8448                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$35)
    8449                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    8450              
    8451              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8452                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    8453                      .dwattr $C$DW$T$19, DW_AT_declaration
    8454                      .dwendtag $C$DW$T$19
    8455              
    8456              $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    8457                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$19)
    8458                      .dwattr $C$DW$T$80, DW_AT_address_class(0x20)
    8459              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    8460                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    8461                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    8462              
    8463              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8464                      .dwattr $C$DW$T$36, DW_AT_name("_FLASH_Obj_")
    8465                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    8466              $C$DW$1512      .dwtag  DW_TAG_member
    8467                      .dwattr $C$DW$1512, DW_AT_type(*$C$DW$T$22)
    8468                      .dwattr $C$DW$1512, DW_AT_name("FOPT")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  163

    8469                      .dwattr $C$DW$1512, DW_AT_TI_symbol_name("_FOPT")
    8470                      .dwattr $C$DW$1512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8471                      .dwattr $C$DW$1512, DW_AT_accessibility(DW_ACCESS_public)
    8472              $C$DW$1513      .dwtag  DW_TAG_member
    8473                      .dwattr $C$DW$1513, DW_AT_type(*$C$DW$T$22)
    8474                      .dwattr $C$DW$1513, DW_AT_name("rsvd_1")
    8475                      .dwattr $C$DW$1513, DW_AT_TI_symbol_name("_rsvd_1")
    8476                      .dwattr $C$DW$1513, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8477                      .dwattr $C$DW$1513, DW_AT_accessibility(DW_ACCESS_public)
    8478              $C$DW$1514      .dwtag  DW_TAG_member
    8479                      .dwattr $C$DW$1514, DW_AT_type(*$C$DW$T$22)
    8480                      .dwattr $C$DW$1514, DW_AT_name("FPWR")
    8481                      .dwattr $C$DW$1514, DW_AT_TI_symbol_name("_FPWR")
    8482                      .dwattr $C$DW$1514, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8483                      .dwattr $C$DW$1514, DW_AT_accessibility(DW_ACCESS_public)
    8484              $C$DW$1515      .dwtag  DW_TAG_member
    8485                      .dwattr $C$DW$1515, DW_AT_type(*$C$DW$T$22)
    8486                      .dwattr $C$DW$1515, DW_AT_name("FSTATUS")
    8487                      .dwattr $C$DW$1515, DW_AT_TI_symbol_name("_FSTATUS")
    8488                      .dwattr $C$DW$1515, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8489                      .dwattr $C$DW$1515, DW_AT_accessibility(DW_ACCESS_public)
    8490              $C$DW$1516      .dwtag  DW_TAG_member
    8491                      .dwattr $C$DW$1516, DW_AT_type(*$C$DW$T$22)
    8492                      .dwattr $C$DW$1516, DW_AT_name("FSTDBYWAIT")
    8493                      .dwattr $C$DW$1516, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    8494                      .dwattr $C$DW$1516, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8495                      .dwattr $C$DW$1516, DW_AT_accessibility(DW_ACCESS_public)
    8496              $C$DW$1517      .dwtag  DW_TAG_member
    8497                      .dwattr $C$DW$1517, DW_AT_type(*$C$DW$T$22)
    8498                      .dwattr $C$DW$1517, DW_AT_name("FACTIVEWAIT")
    8499                      .dwattr $C$DW$1517, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    8500                      .dwattr $C$DW$1517, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8501                      .dwattr $C$DW$1517, DW_AT_accessibility(DW_ACCESS_public)
    8502              $C$DW$1518      .dwtag  DW_TAG_member
    8503                      .dwattr $C$DW$1518, DW_AT_type(*$C$DW$T$22)
    8504                      .dwattr $C$DW$1518, DW_AT_name("FBANKWAIT")
    8505                      .dwattr $C$DW$1518, DW_AT_TI_symbol_name("_FBANKWAIT")
    8506                      .dwattr $C$DW$1518, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8507                      .dwattr $C$DW$1518, DW_AT_accessibility(DW_ACCESS_public)
    8508              $C$DW$1519      .dwtag  DW_TAG_member
    8509                      .dwattr $C$DW$1519, DW_AT_type(*$C$DW$T$22)
    8510                      .dwattr $C$DW$1519, DW_AT_name("FOTPWAIT")
    8511                      .dwattr $C$DW$1519, DW_AT_TI_symbol_name("_FOTPWAIT")
    8512                      .dwattr $C$DW$1519, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8513                      .dwattr $C$DW$1519, DW_AT_accessibility(DW_ACCESS_public)
    8514                      .dwendtag $C$DW$T$36
    8515              
    8516              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    8517                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$36)
    8518                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    8519              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    8520                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    8521                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    8522              
    8523              $C$DW$T$41      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  164

    8524                      .dwattr $C$DW$T$41, DW_AT_name("_GPIO_Obj_")
    8525                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x6a)
    8526              $C$DW$1520      .dwtag  DW_TAG_member
    8527                      .dwattr $C$DW$1520, DW_AT_type(*$C$DW$T$38)
    8528                      .dwattr $C$DW$1520, DW_AT_name("GPACTRL")
    8529                      .dwattr $C$DW$1520, DW_AT_TI_symbol_name("_GPACTRL")
    8530                      .dwattr $C$DW$1520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8531                      .dwattr $C$DW$1520, DW_AT_accessibility(DW_ACCESS_public)
    8532              $C$DW$1521      .dwtag  DW_TAG_member
    8533                      .dwattr $C$DW$1521, DW_AT_type(*$C$DW$T$38)
    8534                      .dwattr $C$DW$1521, DW_AT_name("GPAQSEL1")
    8535                      .dwattr $C$DW$1521, DW_AT_TI_symbol_name("_GPAQSEL1")
    8536                      .dwattr $C$DW$1521, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8537                      .dwattr $C$DW$1521, DW_AT_accessibility(DW_ACCESS_public)
    8538              $C$DW$1522      .dwtag  DW_TAG_member
    8539                      .dwattr $C$DW$1522, DW_AT_type(*$C$DW$T$38)
    8540                      .dwattr $C$DW$1522, DW_AT_name("GPAQSEL2")
    8541                      .dwattr $C$DW$1522, DW_AT_TI_symbol_name("_GPAQSEL2")
    8542                      .dwattr $C$DW$1522, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8543                      .dwattr $C$DW$1522, DW_AT_accessibility(DW_ACCESS_public)
    8544              $C$DW$1523      .dwtag  DW_TAG_member
    8545                      .dwattr $C$DW$1523, DW_AT_type(*$C$DW$T$38)
    8546                      .dwattr $C$DW$1523, DW_AT_name("GPAMUX1")
    8547                      .dwattr $C$DW$1523, DW_AT_TI_symbol_name("_GPAMUX1")
    8548                      .dwattr $C$DW$1523, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8549                      .dwattr $C$DW$1523, DW_AT_accessibility(DW_ACCESS_public)
    8550              $C$DW$1524      .dwtag  DW_TAG_member
    8551                      .dwattr $C$DW$1524, DW_AT_type(*$C$DW$T$38)
    8552                      .dwattr $C$DW$1524, DW_AT_name("GPAMUX2")
    8553                      .dwattr $C$DW$1524, DW_AT_TI_symbol_name("_GPAMUX2")
    8554                      .dwattr $C$DW$1524, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8555                      .dwattr $C$DW$1524, DW_AT_accessibility(DW_ACCESS_public)
    8556              $C$DW$1525      .dwtag  DW_TAG_member
    8557                      .dwattr $C$DW$1525, DW_AT_type(*$C$DW$T$38)
    8558                      .dwattr $C$DW$1525, DW_AT_name("GPADIR")
    8559                      .dwattr $C$DW$1525, DW_AT_TI_symbol_name("_GPADIR")
    8560                      .dwattr $C$DW$1525, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8561                      .dwattr $C$DW$1525, DW_AT_accessibility(DW_ACCESS_public)
    8562              $C$DW$1526      .dwtag  DW_TAG_member
    8563                      .dwattr $C$DW$1526, DW_AT_type(*$C$DW$T$38)
    8564                      .dwattr $C$DW$1526, DW_AT_name("GPAPUD")
    8565                      .dwattr $C$DW$1526, DW_AT_TI_symbol_name("_GPAPUD")
    8566                      .dwattr $C$DW$1526, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8567                      .dwattr $C$DW$1526, DW_AT_accessibility(DW_ACCESS_public)
    8568              $C$DW$1527      .dwtag  DW_TAG_member
    8569                      .dwattr $C$DW$1527, DW_AT_type(*$C$DW$T$25)
    8570                      .dwattr $C$DW$1527, DW_AT_name("rsvd_1")
    8571                      .dwattr $C$DW$1527, DW_AT_TI_symbol_name("_rsvd_1")
    8572                      .dwattr $C$DW$1527, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8573                      .dwattr $C$DW$1527, DW_AT_accessibility(DW_ACCESS_public)
    8574              $C$DW$1528      .dwtag  DW_TAG_member
    8575                      .dwattr $C$DW$1528, DW_AT_type(*$C$DW$T$38)
    8576                      .dwattr $C$DW$1528, DW_AT_name("GPBCTRL")
    8577                      .dwattr $C$DW$1528, DW_AT_TI_symbol_name("_GPBCTRL")
    8578                      .dwattr $C$DW$1528, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  165

    8579                      .dwattr $C$DW$1528, DW_AT_accessibility(DW_ACCESS_public)
    8580              $C$DW$1529      .dwtag  DW_TAG_member
    8581                      .dwattr $C$DW$1529, DW_AT_type(*$C$DW$T$38)
    8582                      .dwattr $C$DW$1529, DW_AT_name("GPBQSEL1")
    8583                      .dwattr $C$DW$1529, DW_AT_TI_symbol_name("_GPBQSEL1")
    8584                      .dwattr $C$DW$1529, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8585                      .dwattr $C$DW$1529, DW_AT_accessibility(DW_ACCESS_public)
    8586              $C$DW$1530      .dwtag  DW_TAG_member
    8587                      .dwattr $C$DW$1530, DW_AT_type(*$C$DW$T$25)
    8588                      .dwattr $C$DW$1530, DW_AT_name("rsvd_2")
    8589                      .dwattr $C$DW$1530, DW_AT_TI_symbol_name("_rsvd_2")
    8590                      .dwattr $C$DW$1530, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8591                      .dwattr $C$DW$1530, DW_AT_accessibility(DW_ACCESS_public)
    8592              $C$DW$1531      .dwtag  DW_TAG_member
    8593                      .dwattr $C$DW$1531, DW_AT_type(*$C$DW$T$38)
    8594                      .dwattr $C$DW$1531, DW_AT_name("GPBMUX1")
    8595                      .dwattr $C$DW$1531, DW_AT_TI_symbol_name("_GPBMUX1")
    8596                      .dwattr $C$DW$1531, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8597                      .dwattr $C$DW$1531, DW_AT_accessibility(DW_ACCESS_public)
    8598              $C$DW$1532      .dwtag  DW_TAG_member
    8599                      .dwattr $C$DW$1532, DW_AT_type(*$C$DW$T$25)
    8600                      .dwattr $C$DW$1532, DW_AT_name("rsvd_3")
    8601                      .dwattr $C$DW$1532, DW_AT_TI_symbol_name("_rsvd_3")
    8602                      .dwattr $C$DW$1532, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8603                      .dwattr $C$DW$1532, DW_AT_accessibility(DW_ACCESS_public)
    8604              $C$DW$1533      .dwtag  DW_TAG_member
    8605                      .dwattr $C$DW$1533, DW_AT_type(*$C$DW$T$38)
    8606                      .dwattr $C$DW$1533, DW_AT_name("GPBDIR")
    8607                      .dwattr $C$DW$1533, DW_AT_TI_symbol_name("_GPBDIR")
    8608                      .dwattr $C$DW$1533, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8609                      .dwattr $C$DW$1533, DW_AT_accessibility(DW_ACCESS_public)
    8610              $C$DW$1534      .dwtag  DW_TAG_member
    8611                      .dwattr $C$DW$1534, DW_AT_type(*$C$DW$T$38)
    8612                      .dwattr $C$DW$1534, DW_AT_name("GPBPUD")
    8613                      .dwattr $C$DW$1534, DW_AT_TI_symbol_name("_GPBPUD")
    8614                      .dwattr $C$DW$1534, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8615                      .dwattr $C$DW$1534, DW_AT_accessibility(DW_ACCESS_public)
    8616              $C$DW$1535      .dwtag  DW_TAG_member
    8617                      .dwattr $C$DW$1535, DW_AT_type(*$C$DW$T$39)
    8618                      .dwattr $C$DW$1535, DW_AT_name("rsvd_4")
    8619                      .dwattr $C$DW$1535, DW_AT_TI_symbol_name("_rsvd_4")
    8620                      .dwattr $C$DW$1535, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8621                      .dwattr $C$DW$1535, DW_AT_accessibility(DW_ACCESS_public)
    8622              $C$DW$1536      .dwtag  DW_TAG_member
    8623                      .dwattr $C$DW$1536, DW_AT_type(*$C$DW$T$38)
    8624                      .dwattr $C$DW$1536, DW_AT_name("AIOMUX1")
    8625                      .dwattr $C$DW$1536, DW_AT_TI_symbol_name("_AIOMUX1")
    8626                      .dwattr $C$DW$1536, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    8627                      .dwattr $C$DW$1536, DW_AT_accessibility(DW_ACCESS_public)
    8628              $C$DW$1537      .dwtag  DW_TAG_member
    8629                      .dwattr $C$DW$1537, DW_AT_type(*$C$DW$T$25)
    8630                      .dwattr $C$DW$1537, DW_AT_name("rsvd_5")
    8631                      .dwattr $C$DW$1537, DW_AT_TI_symbol_name("_rsvd_5")
    8632                      .dwattr $C$DW$1537, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8633                      .dwattr $C$DW$1537, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  166

    8634              $C$DW$1538      .dwtag  DW_TAG_member
    8635                      .dwattr $C$DW$1538, DW_AT_type(*$C$DW$T$38)
    8636                      .dwattr $C$DW$1538, DW_AT_name("AIODIR")
    8637                      .dwattr $C$DW$1538, DW_AT_TI_symbol_name("_AIODIR")
    8638                      .dwattr $C$DW$1538, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    8639                      .dwattr $C$DW$1538, DW_AT_accessibility(DW_ACCESS_public)
    8640              $C$DW$1539      .dwtag  DW_TAG_member
    8641                      .dwattr $C$DW$1539, DW_AT_type(*$C$DW$T$40)
    8642                      .dwattr $C$DW$1539, DW_AT_name("rsvd_6")
    8643                      .dwattr $C$DW$1539, DW_AT_TI_symbol_name("_rsvd_6")
    8644                      .dwattr $C$DW$1539, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8645                      .dwattr $C$DW$1539, DW_AT_accessibility(DW_ACCESS_public)
    8646              $C$DW$1540      .dwtag  DW_TAG_member
    8647                      .dwattr $C$DW$1540, DW_AT_type(*$C$DW$T$38)
    8648                      .dwattr $C$DW$1540, DW_AT_name("GPADAT")
    8649                      .dwattr $C$DW$1540, DW_AT_TI_symbol_name("_GPADAT")
    8650                      .dwattr $C$DW$1540, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8651                      .dwattr $C$DW$1540, DW_AT_accessibility(DW_ACCESS_public)
    8652              $C$DW$1541      .dwtag  DW_TAG_member
    8653                      .dwattr $C$DW$1541, DW_AT_type(*$C$DW$T$38)
    8654                      .dwattr $C$DW$1541, DW_AT_name("GPASET")
    8655                      .dwattr $C$DW$1541, DW_AT_TI_symbol_name("_GPASET")
    8656                      .dwattr $C$DW$1541, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    8657                      .dwattr $C$DW$1541, DW_AT_accessibility(DW_ACCESS_public)
    8658              $C$DW$1542      .dwtag  DW_TAG_member
    8659                      .dwattr $C$DW$1542, DW_AT_type(*$C$DW$T$38)
    8660                      .dwattr $C$DW$1542, DW_AT_name("GPACLEAR")
    8661                      .dwattr $C$DW$1542, DW_AT_TI_symbol_name("_GPACLEAR")
    8662                      .dwattr $C$DW$1542, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8663                      .dwattr $C$DW$1542, DW_AT_accessibility(DW_ACCESS_public)
    8664              $C$DW$1543      .dwtag  DW_TAG_member
    8665                      .dwattr $C$DW$1543, DW_AT_type(*$C$DW$T$38)
    8666                      .dwattr $C$DW$1543, DW_AT_name("GPATOGGLE")
    8667                      .dwattr $C$DW$1543, DW_AT_TI_symbol_name("_GPATOGGLE")
    8668                      .dwattr $C$DW$1543, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8669                      .dwattr $C$DW$1543, DW_AT_accessibility(DW_ACCESS_public)
    8670              $C$DW$1544      .dwtag  DW_TAG_member
    8671                      .dwattr $C$DW$1544, DW_AT_type(*$C$DW$T$38)
    8672                      .dwattr $C$DW$1544, DW_AT_name("GPBDAT")
    8673                      .dwattr $C$DW$1544, DW_AT_TI_symbol_name("_GPBDAT")
    8674                      .dwattr $C$DW$1544, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8675                      .dwattr $C$DW$1544, DW_AT_accessibility(DW_ACCESS_public)
    8676              $C$DW$1545      .dwtag  DW_TAG_member
    8677                      .dwattr $C$DW$1545, DW_AT_type(*$C$DW$T$38)
    8678                      .dwattr $C$DW$1545, DW_AT_name("GPBSET")
    8679                      .dwattr $C$DW$1545, DW_AT_TI_symbol_name("_GPBSET")
    8680                      .dwattr $C$DW$1545, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    8681                      .dwattr $C$DW$1545, DW_AT_accessibility(DW_ACCESS_public)
    8682              $C$DW$1546      .dwtag  DW_TAG_member
    8683                      .dwattr $C$DW$1546, DW_AT_type(*$C$DW$T$38)
    8684                      .dwattr $C$DW$1546, DW_AT_name("GPBCLEAR")
    8685                      .dwattr $C$DW$1546, DW_AT_TI_symbol_name("_GPBCLEAR")
    8686                      .dwattr $C$DW$1546, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    8687                      .dwattr $C$DW$1546, DW_AT_accessibility(DW_ACCESS_public)
    8688              $C$DW$1547      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  167

    8689                      .dwattr $C$DW$1547, DW_AT_type(*$C$DW$T$38)
    8690                      .dwattr $C$DW$1547, DW_AT_name("GPBTOGGLE")
    8691                      .dwattr $C$DW$1547, DW_AT_TI_symbol_name("_GPBTOGGLE")
    8692                      .dwattr $C$DW$1547, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    8693                      .dwattr $C$DW$1547, DW_AT_accessibility(DW_ACCESS_public)
    8694              $C$DW$1548      .dwtag  DW_TAG_member
    8695                      .dwattr $C$DW$1548, DW_AT_type(*$C$DW$T$30)
    8696                      .dwattr $C$DW$1548, DW_AT_name("rsvd_7")
    8697                      .dwattr $C$DW$1548, DW_AT_TI_symbol_name("_rsvd_7")
    8698                      .dwattr $C$DW$1548, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8699                      .dwattr $C$DW$1548, DW_AT_accessibility(DW_ACCESS_public)
    8700              $C$DW$1549      .dwtag  DW_TAG_member
    8701                      .dwattr $C$DW$1549, DW_AT_type(*$C$DW$T$38)
    8702                      .dwattr $C$DW$1549, DW_AT_name("AIODAT")
    8703                      .dwattr $C$DW$1549, DW_AT_TI_symbol_name("_AIODAT")
    8704                      .dwattr $C$DW$1549, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8705                      .dwattr $C$DW$1549, DW_AT_accessibility(DW_ACCESS_public)
    8706              $C$DW$1550      .dwtag  DW_TAG_member
    8707                      .dwattr $C$DW$1550, DW_AT_type(*$C$DW$T$38)
    8708                      .dwattr $C$DW$1550, DW_AT_name("AIOSET")
    8709                      .dwattr $C$DW$1550, DW_AT_TI_symbol_name("_AIOSET")
    8710                      .dwattr $C$DW$1550, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    8711                      .dwattr $C$DW$1550, DW_AT_accessibility(DW_ACCESS_public)
    8712              $C$DW$1551      .dwtag  DW_TAG_member
    8713                      .dwattr $C$DW$1551, DW_AT_type(*$C$DW$T$38)
    8714                      .dwattr $C$DW$1551, DW_AT_name("AIOCLEAR")
    8715                      .dwattr $C$DW$1551, DW_AT_TI_symbol_name("_AIOCLEAR")
    8716                      .dwattr $C$DW$1551, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8717                      .dwattr $C$DW$1551, DW_AT_accessibility(DW_ACCESS_public)
    8718              $C$DW$1552      .dwtag  DW_TAG_member
    8719                      .dwattr $C$DW$1552, DW_AT_type(*$C$DW$T$38)
    8720                      .dwattr $C$DW$1552, DW_AT_name("AIOTOGGLE")
    8721                      .dwattr $C$DW$1552, DW_AT_TI_symbol_name("_AIOTOGGLE")
    8722                      .dwattr $C$DW$1552, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8723                      .dwattr $C$DW$1552, DW_AT_accessibility(DW_ACCESS_public)
    8724              $C$DW$1553      .dwtag  DW_TAG_member
    8725                      .dwattr $C$DW$1553, DW_AT_type(*$C$DW$T$27)
    8726                      .dwattr $C$DW$1553, DW_AT_name("GPIOXINTnSEL")
    8727                      .dwattr $C$DW$1553, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    8728                      .dwattr $C$DW$1553, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8729                      .dwattr $C$DW$1553, DW_AT_accessibility(DW_ACCESS_public)
    8730              $C$DW$1554      .dwtag  DW_TAG_member
    8731                      .dwattr $C$DW$1554, DW_AT_type(*$C$DW$T$26)
    8732                      .dwattr $C$DW$1554, DW_AT_name("rsvd_8")
    8733                      .dwattr $C$DW$1554, DW_AT_TI_symbol_name("_rsvd_8")
    8734                      .dwattr $C$DW$1554, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    8735                      .dwattr $C$DW$1554, DW_AT_accessibility(DW_ACCESS_public)
    8736              $C$DW$1555      .dwtag  DW_TAG_member
    8737                      .dwattr $C$DW$1555, DW_AT_type(*$C$DW$T$38)
    8738                      .dwattr $C$DW$1555, DW_AT_name("GPIOLPMSEL")
    8739                      .dwattr $C$DW$1555, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    8740                      .dwattr $C$DW$1555, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    8741                      .dwattr $C$DW$1555, DW_AT_accessibility(DW_ACCESS_public)
    8742                      .dwendtag $C$DW$T$41
    8743              
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  168

    8744              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    8745                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$41)
    8746                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    8747              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    8748                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    8749                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    8750              
    8751              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    8752                      .dwattr $C$DW$T$43, DW_AT_name("_HAL_AdcData_t_")
    8753                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0e)
    8754              $C$DW$1556      .dwtag  DW_TAG_member
    8755                      .dwattr $C$DW$1556, DW_AT_type(*$C$DW$T$42)
    8756                      .dwattr $C$DW$1556, DW_AT_name("I")
    8757                      .dwattr $C$DW$1556, DW_AT_TI_symbol_name("_I")
    8758                      .dwattr $C$DW$1556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8759                      .dwattr $C$DW$1556, DW_AT_accessibility(DW_ACCESS_public)
    8760              $C$DW$1557      .dwtag  DW_TAG_member
    8761                      .dwattr $C$DW$1557, DW_AT_type(*$C$DW$T$42)
    8762                      .dwattr $C$DW$1557, DW_AT_name("V")
    8763                      .dwattr $C$DW$1557, DW_AT_TI_symbol_name("_V")
    8764                      .dwattr $C$DW$1557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8765                      .dwattr $C$DW$1557, DW_AT_accessibility(DW_ACCESS_public)
    8766              $C$DW$1558      .dwtag  DW_TAG_member
    8767                      .dwattr $C$DW$1558, DW_AT_type(*$C$DW$T$34)
    8768                      .dwattr $C$DW$1558, DW_AT_name("dcBus")
    8769                      .dwattr $C$DW$1558, DW_AT_TI_symbol_name("_dcBus")
    8770                      .dwattr $C$DW$1558, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8771                      .dwattr $C$DW$1558, DW_AT_accessibility(DW_ACCESS_public)
    8772                      .dwendtag $C$DW$T$43
    8773              
    8774              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    8775                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$43)
    8776                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    8777              
    8778              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    8779                      .dwattr $C$DW$T$76, DW_AT_name("_HAL_Obj_")
    8780                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xa6)
    8781              $C$DW$1559      .dwtag  DW_TAG_member
    8782                      .dwattr $C$DW$1559, DW_AT_type(*$C$DW$T$45)
    8783                      .dwattr $C$DW$1559, DW_AT_name("adcHandle")
    8784                      .dwattr $C$DW$1559, DW_AT_TI_symbol_name("_adcHandle")
    8785                      .dwattr $C$DW$1559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8786                      .dwattr $C$DW$1559, DW_AT_accessibility(DW_ACCESS_public)
    8787              $C$DW$1560      .dwtag  DW_TAG_member
    8788                      .dwattr $C$DW$1560, DW_AT_type(*$C$DW$T$47)
    8789                      .dwattr $C$DW$1560, DW_AT_name("clkHandle")
    8790                      .dwattr $C$DW$1560, DW_AT_TI_symbol_name("_clkHandle")
    8791                      .dwattr $C$DW$1560, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8792                      .dwattr $C$DW$1560, DW_AT_accessibility(DW_ACCESS_public)
    8793              $C$DW$1561      .dwtag  DW_TAG_member
    8794                      .dwattr $C$DW$1561, DW_AT_type(*$C$DW$T$49)
    8795                      .dwattr $C$DW$1561, DW_AT_name("cpuHandle")
    8796                      .dwattr $C$DW$1561, DW_AT_TI_symbol_name("_cpuHandle")
    8797                      .dwattr $C$DW$1561, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8798                      .dwattr $C$DW$1561, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  169

    8799              $C$DW$1562      .dwtag  DW_TAG_member
    8800                      .dwattr $C$DW$1562, DW_AT_type(*$C$DW$T$51)
    8801                      .dwattr $C$DW$1562, DW_AT_name("flashHandle")
    8802                      .dwattr $C$DW$1562, DW_AT_TI_symbol_name("_flashHandle")
    8803                      .dwattr $C$DW$1562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8804                      .dwattr $C$DW$1562, DW_AT_accessibility(DW_ACCESS_public)
    8805              $C$DW$1563      .dwtag  DW_TAG_member
    8806                      .dwattr $C$DW$1563, DW_AT_type(*$C$DW$T$53)
    8807                      .dwattr $C$DW$1563, DW_AT_name("gpioHandle")
    8808                      .dwattr $C$DW$1563, DW_AT_TI_symbol_name("_gpioHandle")
    8809                      .dwattr $C$DW$1563, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8810                      .dwattr $C$DW$1563, DW_AT_accessibility(DW_ACCESS_public)
    8811              $C$DW$1564      .dwtag  DW_TAG_member
    8812                      .dwattr $C$DW$1564, DW_AT_type(*$C$DW$T$56)
    8813                      .dwattr $C$DW$1564, DW_AT_name("offsetHandle_I")
    8814                      .dwattr $C$DW$1564, DW_AT_TI_symbol_name("_offsetHandle_I")
    8815                      .dwattr $C$DW$1564, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8816                      .dwattr $C$DW$1564, DW_AT_accessibility(DW_ACCESS_public)
    8817              $C$DW$1565      .dwtag  DW_TAG_member
    8818                      .dwattr $C$DW$1565, DW_AT_type(*$C$DW$T$58)
    8819                      .dwattr $C$DW$1565, DW_AT_name("offset_I")
    8820                      .dwattr $C$DW$1565, DW_AT_TI_symbol_name("_offset_I")
    8821                      .dwattr $C$DW$1565, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8822                      .dwattr $C$DW$1565, DW_AT_accessibility(DW_ACCESS_public)
    8823              $C$DW$1566      .dwtag  DW_TAG_member
    8824                      .dwattr $C$DW$1566, DW_AT_type(*$C$DW$T$56)
    8825                      .dwattr $C$DW$1566, DW_AT_name("offsetHandle_V")
    8826                      .dwattr $C$DW$1566, DW_AT_TI_symbol_name("_offsetHandle_V")
    8827                      .dwattr $C$DW$1566, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8828                      .dwattr $C$DW$1566, DW_AT_accessibility(DW_ACCESS_public)
    8829              $C$DW$1567      .dwtag  DW_TAG_member
    8830                      .dwattr $C$DW$1567, DW_AT_type(*$C$DW$T$58)
    8831                      .dwattr $C$DW$1567, DW_AT_name("offset_V")
    8832                      .dwattr $C$DW$1567, DW_AT_TI_symbol_name("_offset_V")
    8833                      .dwattr $C$DW$1567, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8834                      .dwattr $C$DW$1567, DW_AT_accessibility(DW_ACCESS_public)
    8835              $C$DW$1568      .dwtag  DW_TAG_member
    8836                      .dwattr $C$DW$1568, DW_AT_type(*$C$DW$T$60)
    8837                      .dwattr $C$DW$1568, DW_AT_name("oscHandle")
    8838                      .dwattr $C$DW$1568, DW_AT_TI_symbol_name("_oscHandle")
    8839                      .dwattr $C$DW$1568, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    8840                      .dwattr $C$DW$1568, DW_AT_accessibility(DW_ACCESS_public)
    8841              $C$DW$1569      .dwtag  DW_TAG_member
    8842                      .dwattr $C$DW$1569, DW_AT_type(*$C$DW$T$62)
    8843                      .dwattr $C$DW$1569, DW_AT_name("pieHandle")
    8844                      .dwattr $C$DW$1569, DW_AT_TI_symbol_name("_pieHandle")
    8845                      .dwattr $C$DW$1569, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8846                      .dwattr $C$DW$1569, DW_AT_accessibility(DW_ACCESS_public)
    8847              $C$DW$1570      .dwtag  DW_TAG_member
    8848                      .dwattr $C$DW$1570, DW_AT_type(*$C$DW$T$64)
    8849                      .dwattr $C$DW$1570, DW_AT_name("pllHandle")
    8850                      .dwattr $C$DW$1570, DW_AT_TI_symbol_name("_pllHandle")
    8851                      .dwattr $C$DW$1570, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8852                      .dwattr $C$DW$1570, DW_AT_accessibility(DW_ACCESS_public)
    8853              $C$DW$1571      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  170

    8854                      .dwattr $C$DW$1571, DW_AT_type(*$C$DW$T$67)
    8855                      .dwattr $C$DW$1571, DW_AT_name("pwmHandle")
    8856                      .dwattr $C$DW$1571, DW_AT_TI_symbol_name("_pwmHandle")
    8857                      .dwattr $C$DW$1571, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    8858                      .dwattr $C$DW$1571, DW_AT_accessibility(DW_ACCESS_public)
    8859              $C$DW$1572      .dwtag  DW_TAG_member
    8860                      .dwattr $C$DW$1572, DW_AT_type(*$C$DW$T$67)
    8861                      .dwattr $C$DW$1572, DW_AT_name("pwmDacHandle")
    8862                      .dwattr $C$DW$1572, DW_AT_TI_symbol_name("_pwmDacHandle")
    8863                      .dwattr $C$DW$1572, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    8864                      .dwattr $C$DW$1572, DW_AT_accessibility(DW_ACCESS_public)
    8865              $C$DW$1573      .dwtag  DW_TAG_member
    8866                      .dwattr $C$DW$1573, DW_AT_type(*$C$DW$T$69)
    8867                      .dwattr $C$DW$1573, DW_AT_name("pwrHandle")
    8868                      .dwattr $C$DW$1573, DW_AT_TI_symbol_name("_pwrHandle")
    8869                      .dwattr $C$DW$1573, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    8870                      .dwattr $C$DW$1573, DW_AT_accessibility(DW_ACCESS_public)
    8871              $C$DW$1574      .dwtag  DW_TAG_member
    8872                      .dwattr $C$DW$1574, DW_AT_type(*$C$DW$T$72)
    8873                      .dwattr $C$DW$1574, DW_AT_name("timerHandle")
    8874                      .dwattr $C$DW$1574, DW_AT_TI_symbol_name("_timerHandle")
    8875                      .dwattr $C$DW$1574, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    8876                      .dwattr $C$DW$1574, DW_AT_accessibility(DW_ACCESS_public)
    8877              $C$DW$1575      .dwtag  DW_TAG_member
    8878                      .dwattr $C$DW$1575, DW_AT_type(*$C$DW$T$74)
    8879                      .dwattr $C$DW$1575, DW_AT_name("wdogHandle")
    8880                      .dwattr $C$DW$1575, DW_AT_TI_symbol_name("_wdogHandle")
    8881                      .dwattr $C$DW$1575, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    8882                      .dwattr $C$DW$1575, DW_AT_accessibility(DW_ACCESS_public)
    8883              $C$DW$1576      .dwtag  DW_TAG_member
    8884                      .dwattr $C$DW$1576, DW_AT_type(*$C$DW$T$75)
    8885                      .dwattr $C$DW$1576, DW_AT_name("adcBias")
    8886                      .dwattr $C$DW$1576, DW_AT_TI_symbol_name("_adcBias")
    8887                      .dwattr $C$DW$1576, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8888                      .dwattr $C$DW$1576, DW_AT_accessibility(DW_ACCESS_public)
    8889              $C$DW$1577      .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$1577, DW_AT_type(*$C$DW$T$34)
    8891                      .dwattr $C$DW$1577, DW_AT_name("current_sf")
    8892                      .dwattr $C$DW$1577, DW_AT_TI_symbol_name("_current_sf")
    8893                      .dwattr $C$DW$1577, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8894                      .dwattr $C$DW$1577, DW_AT_accessibility(DW_ACCESS_public)
    8895              $C$DW$1578      .dwtag  DW_TAG_member
    8896                      .dwattr $C$DW$1578, DW_AT_type(*$C$DW$T$34)
    8897                      .dwattr $C$DW$1578, DW_AT_name("voltage_sf")
    8898                      .dwattr $C$DW$1578, DW_AT_TI_symbol_name("_voltage_sf")
    8899                      .dwattr $C$DW$1578, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8900                      .dwattr $C$DW$1578, DW_AT_accessibility(DW_ACCESS_public)
    8901              $C$DW$1579      .dwtag  DW_TAG_member
    8902                      .dwattr $C$DW$1579, DW_AT_type(*$C$DW$T$32)
    8903                      .dwattr $C$DW$1579, DW_AT_name("numCurrentSensors")
    8904                      .dwattr $C$DW$1579, DW_AT_TI_symbol_name("_numCurrentSensors")
    8905                      .dwattr $C$DW$1579, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8906                      .dwattr $C$DW$1579, DW_AT_accessibility(DW_ACCESS_public)
    8907              $C$DW$1580      .dwtag  DW_TAG_member
    8908                      .dwattr $C$DW$1580, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  171

    8909                      .dwattr $C$DW$1580, DW_AT_name("numVoltageSensors")
    8910                      .dwattr $C$DW$1580, DW_AT_TI_symbol_name("_numVoltageSensors")
    8911                      .dwattr $C$DW$1580, DW_AT_data_member_location[DW_OP_plus_uconst 0xa5]
    8912                      .dwattr $C$DW$1580, DW_AT_accessibility(DW_ACCESS_public)
    8913                      .dwendtag $C$DW$T$76
    8914              
    8915              $C$DW$T$292     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    8916                      .dwattr $C$DW$T$292, DW_AT_type(*$C$DW$T$76)
    8917                      .dwattr $C$DW$T$292, DW_AT_language(DW_LANG_C)
    8918              $C$DW$T$293     .dwtag  DW_TAG_pointer_type
    8919                      .dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$292)
    8920                      .dwattr $C$DW$T$293, DW_AT_address_class(0x20)
    8921              $C$DW$T$294     .dwtag  DW_TAG_pointer_type
    8922                      .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$76)
    8923                      .dwattr $C$DW$T$294, DW_AT_address_class(0x20)
    8924              $C$DW$T$295     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    8925                      .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$294)
    8926                      .dwattr $C$DW$T$295, DW_AT_language(DW_LANG_C)
    8927              $C$DW$1581      .dwtag  DW_TAG_TI_far_type
    8928                      .dwattr $C$DW$1581, DW_AT_type(*$C$DW$T$295)
    8929              $C$DW$T$296     .dwtag  DW_TAG_const_type
    8930                      .dwattr $C$DW$T$296, DW_AT_type(*$C$DW$1581)
    8931              
    8932              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    8933                      .dwattr $C$DW$T$78, DW_AT_name("_MATH_vec3_")
    8934                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x06)
    8935              $C$DW$1582      .dwtag  DW_TAG_member
    8936                      .dwattr $C$DW$1582, DW_AT_type(*$C$DW$T$77)
    8937                      .dwattr $C$DW$1582, DW_AT_name("value")
    8938                      .dwattr $C$DW$1582, DW_AT_TI_symbol_name("_value")
    8939                      .dwattr $C$DW$1582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8940                      .dwattr $C$DW$1582, DW_AT_accessibility(DW_ACCESS_public)
    8941                      .dwendtag $C$DW$T$78
    8942              
    8943              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    8944                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$78)
    8945                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    8946              
    8947              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    8948                      .dwattr $C$DW$T$82, DW_AT_name("_OFFSET_")
    8949                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x10)
    8950              $C$DW$1583      .dwtag  DW_TAG_member
    8951                      .dwattr $C$DW$1583, DW_AT_type(*$C$DW$T$34)
    8952                      .dwattr $C$DW$1583, DW_AT_name("value")
    8953                      .dwattr $C$DW$1583, DW_AT_TI_symbol_name("_value")
    8954                      .dwattr $C$DW$1583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8955                      .dwattr $C$DW$1583, DW_AT_accessibility(DW_ACCESS_public)
    8956              $C$DW$1584      .dwtag  DW_TAG_member
    8957                      .dwattr $C$DW$1584, DW_AT_type(*$C$DW$T$34)
    8958                      .dwattr $C$DW$1584, DW_AT_name("bias")
    8959                      .dwattr $C$DW$1584, DW_AT_TI_symbol_name("_bias")
    8960                      .dwattr $C$DW$1584, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8961                      .dwattr $C$DW$1584, DW_AT_accessibility(DW_ACCESS_public)
    8962              $C$DW$1585      .dwtag  DW_TAG_member
    8963                      .dwattr $C$DW$1585, DW_AT_type(*$C$DW$T$79)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  172

    8964                      .dwattr $C$DW$1585, DW_AT_name("filter")
    8965                      .dwattr $C$DW$1585, DW_AT_TI_symbol_name("_filter")
    8966                      .dwattr $C$DW$1585, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8967                      .dwattr $C$DW$1585, DW_AT_accessibility(DW_ACCESS_public)
    8968              $C$DW$1586      .dwtag  DW_TAG_member
    8969                      .dwattr $C$DW$1586, DW_AT_type(*$C$DW$T$81)
    8970                      .dwattr $C$DW$1586, DW_AT_name("filterHandle")
    8971                      .dwattr $C$DW$1586, DW_AT_TI_symbol_name("_filterHandle")
    8972                      .dwattr $C$DW$1586, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8973                      .dwattr $C$DW$1586, DW_AT_accessibility(DW_ACCESS_public)
    8974                      .dwendtag $C$DW$T$82
    8975              
    8976              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
    8977                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$82)
    8978                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    8979              
    8980              $C$DW$T$58      .dwtag  DW_TAG_array_type
    8981                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    8982                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    8983                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x30)
    8984              $C$DW$1587      .dwtag  DW_TAG_subrange_type
    8985                      .dwattr $C$DW$1587, DW_AT_upper_bound(0x02)
    8986                      .dwendtag $C$DW$T$58
    8987              
    8988              
    8989              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8990                      .dwattr $C$DW$T$20, DW_AT_name("_OFFSET_Obj_")
    8991                      .dwattr $C$DW$T$20, DW_AT_declaration
    8992                      .dwendtag $C$DW$T$20
    8993              
    8994              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    8995                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$20)
    8996                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    8997              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
    8998                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    8999                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    9000              
    9001              $C$DW$T$56      .dwtag  DW_TAG_array_type
    9002                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    9003                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    9004                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x06)
    9005              $C$DW$1588      .dwtag  DW_TAG_subrange_type
    9006                      .dwattr $C$DW$1588, DW_AT_upper_bound(0x02)
    9007                      .dwendtag $C$DW$T$56
    9008              
    9009              
    9010              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    9011                      .dwattr $C$DW$T$83, DW_AT_name("_OSC_Obj_")
    9012                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x03)
    9013              $C$DW$1589      .dwtag  DW_TAG_member
    9014                      .dwattr $C$DW$1589, DW_AT_type(*$C$DW$T$22)
    9015                      .dwattr $C$DW$1589, DW_AT_name("INTOSC1TRIM")
    9016                      .dwattr $C$DW$1589, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    9017                      .dwattr $C$DW$1589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9018                      .dwattr $C$DW$1589, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  173

    9019              $C$DW$1590      .dwtag  DW_TAG_member
    9020                      .dwattr $C$DW$1590, DW_AT_type(*$C$DW$T$22)
    9021                      .dwattr $C$DW$1590, DW_AT_name("rsvd_1")
    9022                      .dwattr $C$DW$1590, DW_AT_TI_symbol_name("_rsvd_1")
    9023                      .dwattr $C$DW$1590, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9024                      .dwattr $C$DW$1590, DW_AT_accessibility(DW_ACCESS_public)
    9025              $C$DW$1591      .dwtag  DW_TAG_member
    9026                      .dwattr $C$DW$1591, DW_AT_type(*$C$DW$T$22)
    9027                      .dwattr $C$DW$1591, DW_AT_name("INTOSC2TRIM")
    9028                      .dwattr $C$DW$1591, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    9029                      .dwattr $C$DW$1591, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9030                      .dwattr $C$DW$1591, DW_AT_accessibility(DW_ACCESS_public)
    9031                      .dwendtag $C$DW$T$83
    9032              
    9033              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    9034                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$83)
    9035                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    9036              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
    9037                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    9038                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    9039              
    9040              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    9041                      .dwattr $C$DW$T$84, DW_AT_name("_PIE_IERIFR_t")
    9042                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    9043              $C$DW$1592      .dwtag  DW_TAG_member
    9044                      .dwattr $C$DW$1592, DW_AT_type(*$C$DW$T$22)
    9045                      .dwattr $C$DW$1592, DW_AT_name("IER")
    9046                      .dwattr $C$DW$1592, DW_AT_TI_symbol_name("_IER")
    9047                      .dwattr $C$DW$1592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9048                      .dwattr $C$DW$1592, DW_AT_accessibility(DW_ACCESS_public)
    9049              $C$DW$1593      .dwtag  DW_TAG_member
    9050                      .dwattr $C$DW$1593, DW_AT_type(*$C$DW$T$22)
    9051                      .dwattr $C$DW$1593, DW_AT_name("IFR")
    9052                      .dwattr $C$DW$1593, DW_AT_TI_symbol_name("_IFR")
    9053                      .dwattr $C$DW$1593, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9054                      .dwattr $C$DW$1593, DW_AT_accessibility(DW_ACCESS_public)
    9055                      .dwendtag $C$DW$T$84
    9056              
    9057              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
    9058                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    9059                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    9060              $C$DW$1594      .dwtag  DW_TAG_TI_far_type
    9061                      .dwattr $C$DW$1594, DW_AT_type(*$C$DW$T$85)
    9062              $C$DW$T$86      .dwtag  DW_TAG_volatile_type
    9063                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$1594)
    9064              
    9065              $C$DW$T$87      .dwtag  DW_TAG_array_type
    9066                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    9067                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    9068                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x18)
    9069              $C$DW$1595      .dwtag  DW_TAG_subrange_type
    9070                      .dwattr $C$DW$1595, DW_AT_upper_bound(0x0b)
    9071                      .dwendtag $C$DW$T$87
    9072              
    9073              
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  174

    9074              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    9075                      .dwattr $C$DW$T$94, DW_AT_name("_PIE_Obj_")
    9076                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x639c)
    9077              $C$DW$1596      .dwtag  DW_TAG_member
    9078                      .dwattr $C$DW$1596, DW_AT_type(*$C$DW$T$22)
    9079                      .dwattr $C$DW$1596, DW_AT_name("PIECTRL")
    9080                      .dwattr $C$DW$1596, DW_AT_TI_symbol_name("_PIECTRL")
    9081                      .dwattr $C$DW$1596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9082                      .dwattr $C$DW$1596, DW_AT_accessibility(DW_ACCESS_public)
    9083              $C$DW$1597      .dwtag  DW_TAG_member
    9084                      .dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$22)
    9085                      .dwattr $C$DW$1597, DW_AT_name("PIEACK")
    9086                      .dwattr $C$DW$1597, DW_AT_TI_symbol_name("_PIEACK")
    9087                      .dwattr $C$DW$1597, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9088                      .dwattr $C$DW$1597, DW_AT_accessibility(DW_ACCESS_public)
    9089              $C$DW$1598      .dwtag  DW_TAG_member
    9090                      .dwattr $C$DW$1598, DW_AT_type(*$C$DW$T$87)
    9091                      .dwattr $C$DW$1598, DW_AT_name("PIEIER_PIEIFR")
    9092                      .dwattr $C$DW$1598, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    9093                      .dwattr $C$DW$1598, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9094                      .dwattr $C$DW$1598, DW_AT_accessibility(DW_ACCESS_public)
    9095              $C$DW$1599      .dwtag  DW_TAG_member
    9096                      .dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$88)
    9097                      .dwattr $C$DW$1599, DW_AT_name("rsvd_1")
    9098                      .dwattr $C$DW$1599, DW_AT_TI_symbol_name("_rsvd_1")
    9099                      .dwattr $C$DW$1599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9100                      .dwattr $C$DW$1599, DW_AT_accessibility(DW_ACCESS_public)
    9101              $C$DW$1600      .dwtag  DW_TAG_member
    9102                      .dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$92)
    9103                      .dwattr $C$DW$1600, DW_AT_name("Reset")
    9104                      .dwattr $C$DW$1600, DW_AT_TI_symbol_name("_Reset")
    9105                      .dwattr $C$DW$1600, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9106                      .dwattr $C$DW$1600, DW_AT_accessibility(DW_ACCESS_public)
    9107              $C$DW$1601      .dwtag  DW_TAG_member
    9108                      .dwattr $C$DW$1601, DW_AT_type(*$C$DW$T$92)
    9109                      .dwattr $C$DW$1601, DW_AT_name("INT1")
    9110                      .dwattr $C$DW$1601, DW_AT_TI_symbol_name("_INT1")
    9111                      .dwattr $C$DW$1601, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9112                      .dwattr $C$DW$1601, DW_AT_accessibility(DW_ACCESS_public)
    9113              $C$DW$1602      .dwtag  DW_TAG_member
    9114                      .dwattr $C$DW$1602, DW_AT_type(*$C$DW$T$92)
    9115                      .dwattr $C$DW$1602, DW_AT_name("INT2")
    9116                      .dwattr $C$DW$1602, DW_AT_TI_symbol_name("_INT2")
    9117                      .dwattr $C$DW$1602, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    9118                      .dwattr $C$DW$1602, DW_AT_accessibility(DW_ACCESS_public)
    9119              $C$DW$1603      .dwtag  DW_TAG_member
    9120                      .dwattr $C$DW$1603, DW_AT_type(*$C$DW$T$92)
    9121                      .dwattr $C$DW$1603, DW_AT_name("INT3")
    9122                      .dwattr $C$DW$1603, DW_AT_TI_symbol_name("_INT3")
    9123                      .dwattr $C$DW$1603, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9124                      .dwattr $C$DW$1603, DW_AT_accessibility(DW_ACCESS_public)
    9125              $C$DW$1604      .dwtag  DW_TAG_member
    9126                      .dwattr $C$DW$1604, DW_AT_type(*$C$DW$T$92)
    9127                      .dwattr $C$DW$1604, DW_AT_name("INT4")
    9128                      .dwattr $C$DW$1604, DW_AT_TI_symbol_name("_INT4")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  175

    9129                      .dwattr $C$DW$1604, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9130                      .dwattr $C$DW$1604, DW_AT_accessibility(DW_ACCESS_public)
    9131              $C$DW$1605      .dwtag  DW_TAG_member
    9132                      .dwattr $C$DW$1605, DW_AT_type(*$C$DW$T$92)
    9133                      .dwattr $C$DW$1605, DW_AT_name("INT5")
    9134                      .dwattr $C$DW$1605, DW_AT_TI_symbol_name("_INT5")
    9135                      .dwattr $C$DW$1605, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9136                      .dwattr $C$DW$1605, DW_AT_accessibility(DW_ACCESS_public)
    9137              $C$DW$1606      .dwtag  DW_TAG_member
    9138                      .dwattr $C$DW$1606, DW_AT_type(*$C$DW$T$92)
    9139                      .dwattr $C$DW$1606, DW_AT_name("INT6")
    9140                      .dwattr $C$DW$1606, DW_AT_TI_symbol_name("_INT6")
    9141                      .dwattr $C$DW$1606, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9142                      .dwattr $C$DW$1606, DW_AT_accessibility(DW_ACCESS_public)
    9143              $C$DW$1607      .dwtag  DW_TAG_member
    9144                      .dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$92)
    9145                      .dwattr $C$DW$1607, DW_AT_name("INT7")
    9146                      .dwattr $C$DW$1607, DW_AT_TI_symbol_name("_INT7")
    9147                      .dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9148                      .dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
    9149              $C$DW$1608      .dwtag  DW_TAG_member
    9150                      .dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$92)
    9151                      .dwattr $C$DW$1608, DW_AT_name("INT8")
    9152                      .dwattr $C$DW$1608, DW_AT_TI_symbol_name("_INT8")
    9153                      .dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9154                      .dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
    9155              $C$DW$1609      .dwtag  DW_TAG_member
    9156                      .dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$92)
    9157                      .dwattr $C$DW$1609, DW_AT_name("INT9")
    9158                      .dwattr $C$DW$1609, DW_AT_TI_symbol_name("_INT9")
    9159                      .dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9160                      .dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
    9161              $C$DW$1610      .dwtag  DW_TAG_member
    9162                      .dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$92)
    9163                      .dwattr $C$DW$1610, DW_AT_name("INT10")
    9164                      .dwattr $C$DW$1610, DW_AT_TI_symbol_name("_INT10")
    9165                      .dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9166                      .dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
    9167              $C$DW$1611      .dwtag  DW_TAG_member
    9168                      .dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$92)
    9169                      .dwattr $C$DW$1611, DW_AT_name("INT11")
    9170                      .dwattr $C$DW$1611, DW_AT_TI_symbol_name("_INT11")
    9171                      .dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9172                      .dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
    9173              $C$DW$1612      .dwtag  DW_TAG_member
    9174                      .dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$92)
    9175                      .dwattr $C$DW$1612, DW_AT_name("INT12")
    9176                      .dwattr $C$DW$1612, DW_AT_TI_symbol_name("_INT12")
    9177                      .dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9178                      .dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
    9179              $C$DW$1613      .dwtag  DW_TAG_member
    9180                      .dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$92)
    9181                      .dwattr $C$DW$1613, DW_AT_name("TINT1")
    9182                      .dwattr $C$DW$1613, DW_AT_TI_symbol_name("_TINT1")
    9183                      .dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  176

    9184                      .dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
    9185              $C$DW$1614      .dwtag  DW_TAG_member
    9186                      .dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$92)
    9187                      .dwattr $C$DW$1614, DW_AT_name("TINT2")
    9188                      .dwattr $C$DW$1614, DW_AT_TI_symbol_name("_TINT2")
    9189                      .dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9190                      .dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
    9191              $C$DW$1615      .dwtag  DW_TAG_member
    9192                      .dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$92)
    9193                      .dwattr $C$DW$1615, DW_AT_name("DATALOG")
    9194                      .dwattr $C$DW$1615, DW_AT_TI_symbol_name("_DATALOG")
    9195                      .dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    9196                      .dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
    9197              $C$DW$1616      .dwtag  DW_TAG_member
    9198                      .dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$92)
    9199                      .dwattr $C$DW$1616, DW_AT_name("RTOSINT")
    9200                      .dwattr $C$DW$1616, DW_AT_TI_symbol_name("_RTOSINT")
    9201                      .dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9202                      .dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
    9203              $C$DW$1617      .dwtag  DW_TAG_member
    9204                      .dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$92)
    9205                      .dwattr $C$DW$1617, DW_AT_name("EMUINT")
    9206                      .dwattr $C$DW$1617, DW_AT_TI_symbol_name("_EMUINT")
    9207                      .dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9208                      .dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
    9209              $C$DW$1618      .dwtag  DW_TAG_member
    9210                      .dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$92)
    9211                      .dwattr $C$DW$1618, DW_AT_name("NMI")
    9212                      .dwattr $C$DW$1618, DW_AT_TI_symbol_name("_NMI")
    9213                      .dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9214                      .dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
    9215              $C$DW$1619      .dwtag  DW_TAG_member
    9216                      .dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$92)
    9217                      .dwattr $C$DW$1619, DW_AT_name("ILLEGAL")
    9218                      .dwattr $C$DW$1619, DW_AT_TI_symbol_name("_ILLEGAL")
    9219                      .dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9220                      .dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
    9221              $C$DW$1620      .dwtag  DW_TAG_member
    9222                      .dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$92)
    9223                      .dwattr $C$DW$1620, DW_AT_name("USER1")
    9224                      .dwattr $C$DW$1620, DW_AT_TI_symbol_name("_USER1")
    9225                      .dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9226                      .dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
    9227              $C$DW$1621      .dwtag  DW_TAG_member
    9228                      .dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$92)
    9229                      .dwattr $C$DW$1621, DW_AT_name("USER2")
    9230                      .dwattr $C$DW$1621, DW_AT_TI_symbol_name("_USER2")
    9231                      .dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    9232                      .dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
    9233              $C$DW$1622      .dwtag  DW_TAG_member
    9234                      .dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$92)
    9235                      .dwattr $C$DW$1622, DW_AT_name("USER3")
    9236                      .dwattr $C$DW$1622, DW_AT_TI_symbol_name("_USER3")
    9237                      .dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9238                      .dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:54 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\6082010                          PAGE  177

    9239              $C$DW$1623      .dwtag  DW_TAG_member
    9240                      .dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$92)
    9241                      .dwattr $C$DW$1623, DW_AT_name("USER4")
    9242                      .dwattr $C$DW$1623, DW_AT_TI_symbol_name("_USER4")
    9243                      .dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    9244                      .dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
    9245              $C$DW$1624      .dwtag  DW_TAG_member
    9246                      .dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$92)
    9247                      .dwattr $C$DW$1624, DW_AT_name("USER5")
    9248                      .dwattr $C$DW$1624, DW_AT_TI_symbol_name("_USER5")
    9249                      .dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    9250                      .dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
    9251              $C$DW$1625      .dwtag  DW_TAG_member
    9252                      .dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$92)
    9253                      .dwattr $C$DW$1625, DW_AT_name("USER6")
    9254                      .dwattr $C$DW$1625, DW_AT_TI_symbol_name("_USER6")
    9255                      .dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    9256                      .dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
    9257              $C$DW$1626      .dwtag  DW_TAG_member
    9258                      .dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$92)
    9259                      .dwattr $C$DW$1626, DW_AT_name("USER7")
    9260                      .dwattr $C$DW$1626, DW_AT_TI_symbol_name("_USER7")
    9261                      .dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    9262                      .dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
    9263              $C$DW$1627      .dwtag  DW_TAG_member
    9264                      .dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$92)
    9265                      .dwattr $C$DW$1627, DW_AT_name("USER8")
    9266                      .dwattr $C$DW$1627, DW_AT_TI_symbol_name("_USER8")
    9267                      .dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9268                      .dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
    9269              $C$DW$1628      .dwtag  DW_TAG_member
    9270                      .dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$92)
    9271                      .dwattr $C$DW$1628, DW_AT_name("USER9")
    9272                      .dwattr $C$DW$1628, DW_AT_TI_symbol_name("_USER9")
