TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.9 *
       3              ;* Date/Time created: Wed Dec 02 17:22:56 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.9 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_15\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    2972              $C$DW$431       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    2973              $C$DW$432       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    2974              $C$DW$433       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    2975              $C$DW$434       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    2976              $C$DW$435       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    2977              $C$DW$436       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    2978              $C$DW$437       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    2979              $C$DW$438       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    2980              $C$DW$439       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    2981              $C$DW$440       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    2982                      .dwendtag $C$DW$T$177
    2983              
    2984              $C$DW$T$178     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    2985                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    2986                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    2987              $C$DW$441       .dwtag  DW_TAG_TI_far_type
    2988                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$178)
    2989              $C$DW$T$179     .dwtag  DW_TAG_const_type
    2990                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$441)
    2991              
    2992              $C$DW$T$180     .dwtag  DW_TAG_enumeration_type
    2993                      .dwattr $C$DW$T$180, DW_AT_byte_size(0x01)
    2994              $C$DW$442       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    2995              $C$DW$443       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    2996              $C$DW$444       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    2997              $C$DW$445       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    2998              $C$DW$446       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    2999              $C$DW$447       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3000              $C$DW$448       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3001              $C$DW$449       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3002              $C$DW$450       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3003              $C$DW$451       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3004              $C$DW$452       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3005              $C$DW$453       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3006                      .dwendtag $C$DW$T$180
    3007              
    3008              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3009                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
    3010                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    3011              
    3012              $C$DW$T$183     .dwtag  DW_TAG_enumeration_type
    3013                      .dwattr $C$DW$T$183, DW_AT_byte_size(0x01)
    3014              $C$DW$454       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   61

    3015              $C$DW$455       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3016              $C$DW$456       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3017                      .dwendtag $C$DW$T$183
    3018              
    3019              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3020                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    3021                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    3022              
    3023              $C$DW$T$186     .dwtag  DW_TAG_enumeration_type
    3024                      .dwattr $C$DW$T$186, DW_AT_byte_size(0x01)
    3025              $C$DW$457       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3026              $C$DW$458       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3027                      .dwendtag $C$DW$T$186
    3028              
    3029              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3030                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    3031                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    3032              
    3033              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3034                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    3035                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    3036              $C$DW$459       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
    3038                      .dwattr $C$DW$459, DW_AT_name("ADCRESULT")
    3039                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_ADCRESULT")
    3040                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3041                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3042              $C$DW$460       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$25)
    3044                      .dwattr $C$DW$460, DW_AT_name("resvd_1")
    3045                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_resvd_1")
    3046                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3047                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3048              $C$DW$461       .dwtag  DW_TAG_member
    3049                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$23)
    3050                      .dwattr $C$DW$461, DW_AT_name("ADCCTL1")
    3051                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_ADCCTL1")
    3052                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3053                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3054              $C$DW$462       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$23)
    3056                      .dwattr $C$DW$462, DW_AT_name("ADCCTL2")
    3057                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_ADCCTL2")
    3058                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3059                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3060              $C$DW$463       .dwtag  DW_TAG_member
    3061                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$26)
    3062                      .dwattr $C$DW$463, DW_AT_name("rsvd_2")
    3063                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_rsvd_2")
    3064                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3065                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3066              $C$DW$464       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$23)
    3068                      .dwattr $C$DW$464, DW_AT_name("ADCINTFLG")
    3069                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_ADCINTFLG")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   62

    3070                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3071                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3072              $C$DW$465       .dwtag  DW_TAG_member
    3073                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$23)
    3074                      .dwattr $C$DW$465, DW_AT_name("ADCINTFLGCLR")
    3075                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3076                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3077                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3078              $C$DW$466       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$23)
    3080                      .dwattr $C$DW$466, DW_AT_name("ADCINTOVF")
    3081                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_ADCINTOVF")
    3082                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3083                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3084              $C$DW$467       .dwtag  DW_TAG_member
    3085                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$23)
    3086                      .dwattr $C$DW$467, DW_AT_name("ADCINTOVFCLR")
    3087                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3088                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3089                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3090              $C$DW$468       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$27)
    3092                      .dwattr $C$DW$468, DW_AT_name("INTSELxNy")
    3093                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_INTSELxNy")
    3094                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3095                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3096              $C$DW$469       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$28)
    3098                      .dwattr $C$DW$469, DW_AT_name("rsvd_3")
    3099                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_rsvd_3")
    3100                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3101                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3102              $C$DW$470       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$23)
    3104                      .dwattr $C$DW$470, DW_AT_name("SOCPRICTRL")
    3105                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3106                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3107                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3108              $C$DW$471       .dwtag  DW_TAG_member
    3109                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$23)
    3110                      .dwattr $C$DW$471, DW_AT_name("rsvd_4")
    3111                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_rsvd_4")
    3112                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3113                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3114              $C$DW$472       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$23)
    3116                      .dwattr $C$DW$472, DW_AT_name("ADCSAMPLEMODE")
    3117                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3118                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3119                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3120              $C$DW$473       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$23)
    3122                      .dwattr $C$DW$473, DW_AT_name("rsvd_5")
    3123                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_rsvd_5")
    3124                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   63

    3125                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3126              $C$DW$474       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$23)
    3128                      .dwattr $C$DW$474, DW_AT_name("ADCINTSOCSEL1")
    3129                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3130                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3131                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3132              $C$DW$475       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$23)
    3134                      .dwattr $C$DW$475, DW_AT_name("ADCINTSOCSEL2")
    3135                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3136                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3137                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$476       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$26)
    3140                      .dwattr $C$DW$476, DW_AT_name("rsvd_6")
    3141                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_rsvd_6")
    3142                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3143                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3144              $C$DW$477       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$23)
    3146                      .dwattr $C$DW$477, DW_AT_name("ADCSOCFLG1")
    3147                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3148                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3149                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3150              $C$DW$478       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$23)
    3152                      .dwattr $C$DW$478, DW_AT_name("rsvd_7")
    3153                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_rsvd_7")
    3154                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3155                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3156              $C$DW$479       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$23)
    3158                      .dwattr $C$DW$479, DW_AT_name("ADCSOCFRC1")
    3159                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3160                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3161                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3162              $C$DW$480       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$23)
    3164                      .dwattr $C$DW$480, DW_AT_name("rsvd_8")
    3165                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_rsvd_8")
    3166                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3167                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3168              $C$DW$481       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$23)
    3170                      .dwattr $C$DW$481, DW_AT_name("ADCSOCOVF1")
    3171                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3172                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3173                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3174              $C$DW$482       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$23)
    3176                      .dwattr $C$DW$482, DW_AT_name("rsvd_9")
    3177                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_rsvd_9")
    3178                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3179                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   64

    3180              $C$DW$483       .dwtag  DW_TAG_member
    3181                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$23)
    3182                      .dwattr $C$DW$483, DW_AT_name("ADCSOCOVFCLR1")
    3183                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3184                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3185                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3186              $C$DW$484       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$23)
    3188                      .dwattr $C$DW$484, DW_AT_name("rsvd_10")
    3189                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_rsvd_10")
    3190                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3191                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3192              $C$DW$485       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$24)
    3194                      .dwattr $C$DW$485, DW_AT_name("ADCSOCxCTL")
    3195                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3196                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3197                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3198              $C$DW$486       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$24)
    3200                      .dwattr $C$DW$486, DW_AT_name("rsvd_11")
    3201                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_rsvd_11")
    3202                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3203                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3204              $C$DW$487       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$23)
    3206                      .dwattr $C$DW$487, DW_AT_name("ADCREFTRIM")
    3207                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3208                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3209                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3210              $C$DW$488       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$23)
    3212                      .dwattr $C$DW$488, DW_AT_name("ADCOFFTRIM")
    3213                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3214                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3215                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3216              $C$DW$489       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$29)
    3218                      .dwattr $C$DW$489, DW_AT_name("resvd_12")
    3219                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_resvd_12")
    3220                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3221                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3222              $C$DW$490       .dwtag  DW_TAG_member
    3223                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$23)
    3224                      .dwattr $C$DW$490, DW_AT_name("ADCREV")
    3225                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_ADCREV")
    3226                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3227                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3228                      .dwendtag $C$DW$T$30
    3229              
    3230              $C$DW$T$189     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3231                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$30)
    3232                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    3233              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3234                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   65

    3235                      .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    3236              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3237                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3238                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3239              
    3240              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3241                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    3242                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    3243              $C$DW$491       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$31)
    3245                      .dwattr $C$DW$491, DW_AT_name("alpha_sf")
    3246                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_alpha_sf")
    3247                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3248                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3249              $C$DW$492       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$31)
    3251                      .dwattr $C$DW$492, DW_AT_name("beta_sf")
    3252                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_beta_sf")
    3253                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3254                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3255              $C$DW$493       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$32)
    3257                      .dwattr $C$DW$493, DW_AT_name("numSensors")
    3258                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_numSensors")
    3259                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3260                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3261                      .dwendtag $C$DW$T$33
    3262              
    3263              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3264                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    3265                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3266              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    3267                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    3268                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    3269              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3270                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3271                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3272              
    3273              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3274                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    3275                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    3276              $C$DW$494       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$23)
    3278                      .dwattr $C$DW$494, DW_AT_name("XCLK")
    3279                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_XCLK")
    3280                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3281                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3282              $C$DW$495       .dwtag  DW_TAG_member
    3283                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$23)
    3284                      .dwattr $C$DW$495, DW_AT_name("rsvd_1")
    3285                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_rsvd_1")
    3286                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3287                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3288              $C$DW$496       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   66

    3290                      .dwattr $C$DW$496, DW_AT_name("CLKCTL")
    3291                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_CLKCTL")
    3292                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3293                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3294              $C$DW$497       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$34)
    3296                      .dwattr $C$DW$497, DW_AT_name("rsvd_2")
    3297                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_rsvd_2")
    3298                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3299                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3300              $C$DW$498       .dwtag  DW_TAG_member
    3301                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$23)
    3302                      .dwattr $C$DW$498, DW_AT_name("LOSPCP")
    3303                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_LOSPCP")
    3304                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3305                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3306              $C$DW$499       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$23)
    3308                      .dwattr $C$DW$499, DW_AT_name("PCLKCR0")
    3309                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_PCLKCR0")
    3310                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3311                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3312              $C$DW$500       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$23)
    3314                      .dwattr $C$DW$500, DW_AT_name("PCLKCR1")
    3315                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_PCLKCR1")
    3316                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3317                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3318              $C$DW$501       .dwtag  DW_TAG_member
    3319                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$26)
    3320                      .dwattr $C$DW$501, DW_AT_name("rsvd_3")
    3321                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_rsvd_3")
    3322                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3323                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3324              $C$DW$502       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$23)
    3326                      .dwattr $C$DW$502, DW_AT_name("PCLKCR3")
    3327                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_PCLKCR3")
    3328                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3329                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3330                      .dwendtag $C$DW$T$35
    3331              
    3332              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3333                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$35)
    3334                      .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    3335              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3336                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3337                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3338              
    3339              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3340                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    3341                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    3342              $C$DW$503       .dwtag  DW_TAG_member
    3343                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$32)
    3344                      .dwattr $C$DW$503, DW_AT_name("tmp")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   67

    3345                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_tmp")
    3346                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3347                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3348                      .dwendtag $C$DW$T$36
    3349              
    3350              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3351                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$36)
    3352                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3353              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3354                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3355                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3356              
    3357              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3358                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    3359                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    3360              $C$DW$504       .dwtag  DW_TAG_member
    3361                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$37)
    3362                      .dwattr $C$DW$504, DW_AT_name("version")
    3363                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_version")
    3364                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3365                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3366              $C$DW$505       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$39)
    3368                      .dwattr $C$DW$505, DW_AT_name("state")
    3369                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_state")
    3370                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3371                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3372              $C$DW$506       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$39)
    3374                      .dwattr $C$DW$506, DW_AT_name("prevState")
    3375                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_prevState")
    3376                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3377                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3378              $C$DW$507       .dwtag  DW_TAG_member
    3379                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$41)
    3380                      .dwattr $C$DW$507, DW_AT_name("errorCode")
    3381                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_errorCode")
    3382                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3383                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3384              $C$DW$508       .dwtag  DW_TAG_member
    3385                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$43)
    3386                      .dwattr $C$DW$508, DW_AT_name("clarkeHandle_I")
    3387                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3388                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3389                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3390              $C$DW$509       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$44)
    3392                      .dwattr $C$DW$509, DW_AT_name("clarke_I")
    3393                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_clarke_I")
    3394                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3395                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3396              $C$DW$510       .dwtag  DW_TAG_member
    3397                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$43)
    3398                      .dwattr $C$DW$510, DW_AT_name("clarkeHandle_V")
    3399                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_clarkeHandle_V")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   68

    3400                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3401                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3402              $C$DW$511       .dwtag  DW_TAG_member
    3403                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$44)
    3404                      .dwattr $C$DW$511, DW_AT_name("clarke_V")
    3405                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_clarke_V")
    3406                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3407                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3408              $C$DW$512       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$46)
    3410                      .dwattr $C$DW$512, DW_AT_name("estHandle")
    3411                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_estHandle")
    3412                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3413                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3414              $C$DW$513       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$48)
    3416                      .dwattr $C$DW$513, DW_AT_name("parkHandle")
    3417                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_parkHandle")
    3418                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3419                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3420              $C$DW$514       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$49)
    3422                      .dwattr $C$DW$514, DW_AT_name("park")
    3423                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_park")
    3424                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3425                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3426              $C$DW$515       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$51)
    3428                      .dwattr $C$DW$515, DW_AT_name("pidHandle_Id")
    3429                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_pidHandle_Id")
    3430                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3431                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3432              $C$DW$516       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$52)
    3434                      .dwattr $C$DW$516, DW_AT_name("pid_Id")
    3435                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_pid_Id")
    3436                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3437                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3438              $C$DW$517       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$51)
    3440                      .dwattr $C$DW$517, DW_AT_name("pidHandle_Iq")
    3441                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3442                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3443                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3444              $C$DW$518       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$52)
    3446                      .dwattr $C$DW$518, DW_AT_name("pid_Iq")
    3447                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_pid_Iq")
    3448                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3449                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$519       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$51)
    3452                      .dwattr $C$DW$519, DW_AT_name("pidHandle_spd")
    3453                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_pidHandle_spd")
    3454                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   69

    3455                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3456              $C$DW$520       .dwtag  DW_TAG_member
    3457                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$52)
    3458                      .dwattr $C$DW$520, DW_AT_name("pid_spd")
    3459                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_pid_spd")
    3460                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3461                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3462              $C$DW$521       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    3464                      .dwattr $C$DW$521, DW_AT_name("iparkHandle")
    3465                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_iparkHandle")
    3466                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3467                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3468              $C$DW$522       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$55)
    3470                      .dwattr $C$DW$522, DW_AT_name("ipark")
    3471                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_ipark")
    3472                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3473                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3474              $C$DW$523       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$57)
    3476                      .dwattr $C$DW$523, DW_AT_name("svgenHandle")
    3477                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_svgenHandle")
    3478                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3479                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3480              $C$DW$524       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$58)
    3482                      .dwattr $C$DW$524, DW_AT_name("svgen")
    3483                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_svgen")
    3484                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3485                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3486              $C$DW$525       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$60)
    3488                      .dwattr $C$DW$525, DW_AT_name("trajHandle_Id")
    3489                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_trajHandle_Id")
    3490                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3491                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$526       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$61)
    3494                      .dwattr $C$DW$526, DW_AT_name("traj_Id")
    3495                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_traj_Id")
    3496                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3497                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3498              $C$DW$527       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$60)
    3500                      .dwattr $C$DW$527, DW_AT_name("trajHandle_spd")
    3501                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_trajHandle_spd")
    3502                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3503                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    3504              $C$DW$528       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$61)
    3506                      .dwattr $C$DW$528, DW_AT_name("traj_spd")
    3507                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_traj_spd")
    3508                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3509                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   70

    3510              $C$DW$529       .dwtag  DW_TAG_member
    3511                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$60)
    3512                      .dwattr $C$DW$529, DW_AT_name("trajHandle_spdMax")
    3513                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3514                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3515                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3516              $C$DW$530       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$61)
    3518                      .dwattr $C$DW$530, DW_AT_name("traj_spdMax")
    3519                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_traj_spdMax")
    3520                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3521                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3522              $C$DW$531       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$62)
    3524                      .dwattr $C$DW$531, DW_AT_name("motorParams")
    3525                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_motorParams")
    3526                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3527                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3528              $C$DW$532       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$65)
    3530                      .dwattr $C$DW$532, DW_AT_name("waitTimes")
    3531                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_waitTimes")
    3532                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3533                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3534              $C$DW$533       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$64)
    3536                      .dwattr $C$DW$533, DW_AT_name("counter_state")
    3537                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_counter_state")
    3538                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3539                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$534       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$66)
    3542                      .dwattr $C$DW$534, DW_AT_name("numIsrTicksPerCtrlTick")
    3543                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3544                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3545                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$535       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$66)
    3548                      .dwattr $C$DW$535, DW_AT_name("numCtrlTicksPerCurrentTick")
    3549                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3550                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3551                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$536       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$66)
    3554                      .dwattr $C$DW$536, DW_AT_name("numCtrlTicksPerSpeedTick")
    3555                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3556                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3557                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3558              $C$DW$537       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$66)
    3560                      .dwattr $C$DW$537, DW_AT_name("numCtrlTicksPerTrajTick")
    3561                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3562                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3563                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3564              $C$DW$538       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   71

    3565                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$64)
    3566                      .dwattr $C$DW$538, DW_AT_name("ctrlFreq_Hz")
    3567                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3568                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3569                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3570              $C$DW$539       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$64)
    3572                      .dwattr $C$DW$539, DW_AT_name("trajFreq_Hz")
    3573                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3574                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3575                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3576              $C$DW$540       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$31)
    3578                      .dwattr $C$DW$540, DW_AT_name("trajPeriod_sec")
    3579                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3580                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3581                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3582              $C$DW$541       .dwtag  DW_TAG_member
    3583                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$67)
    3584                      .dwattr $C$DW$541, DW_AT_name("ctrlPeriod_sec")
    3585                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3586                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3587                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3588              $C$DW$542       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$31)
    3590                      .dwattr $C$DW$542, DW_AT_name("maxVsMag_pu")
    3591                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3592                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3593                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3594              $C$DW$543       .dwtag  DW_TAG_member
    3595                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$68)
    3596                      .dwattr $C$DW$543, DW_AT_name("Iab_in")
    3597                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_Iab_in")
    3598                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3599                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3600              $C$DW$544       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$68)
    3602                      .dwattr $C$DW$544, DW_AT_name("Iab_filt")
    3603                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_Iab_filt")
    3604                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3605                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3606              $C$DW$545       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$68)
    3608                      .dwattr $C$DW$545, DW_AT_name("Idq_in")
    3609                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_Idq_in")
    3610                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3611                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3612              $C$DW$546       .dwtag  DW_TAG_member
    3613                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$68)
    3614                      .dwattr $C$DW$546, DW_AT_name("Vab_in")
    3615                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_Vab_in")
    3616                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3617                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3618              $C$DW$547       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   72

    3620                      .dwattr $C$DW$547, DW_AT_name("spd_out")
    3621                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_spd_out")
    3622                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3623                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3624              $C$DW$548       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$68)
    3626                      .dwattr $C$DW$548, DW_AT_name("Vab_out")
    3627                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_Vab_out")
    3628                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3629                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3630              $C$DW$549       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$68)
    3632                      .dwattr $C$DW$549, DW_AT_name("Vdq_out")
    3633                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_Vdq_out")
    3634                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3635                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$550       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$67)
    3638                      .dwattr $C$DW$550, DW_AT_name("Rhf")
    3639                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_Rhf")
    3640                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3641                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3642              $C$DW$551       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$67)
    3644                      .dwattr $C$DW$551, DW_AT_name("Lhf")
    3645                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_Lhf")
    3646                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3647                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3648              $C$DW$552       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$67)
    3650                      .dwattr $C$DW$552, DW_AT_name("RoverL")
    3651                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_RoverL")
    3652                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3653                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3654              $C$DW$553       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$31)
    3656                      .dwattr $C$DW$553, DW_AT_name("Kp_Id")
    3657                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_Kp_Id")
    3658                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3659                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3660              $C$DW$554       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$31)
    3662                      .dwattr $C$DW$554, DW_AT_name("Kp_Iq")
    3663                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_Kp_Iq")
    3664                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3665                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3666              $C$DW$555       .dwtag  DW_TAG_member
    3667                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$31)
    3668                      .dwattr $C$DW$555, DW_AT_name("Kp_spd")
    3669                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_Kp_spd")
    3670                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3671                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3672              $C$DW$556       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$31)
    3674                      .dwattr $C$DW$556, DW_AT_name("Ki_Id")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   73

    3675                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_Ki_Id")
    3676                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3677                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3678              $C$DW$557       .dwtag  DW_TAG_member
    3679                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$31)
    3680                      .dwattr $C$DW$557, DW_AT_name("Ki_Iq")
    3681                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_Ki_Iq")
    3682                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3683                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3684              $C$DW$558       .dwtag  DW_TAG_member
    3685                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$31)
    3686                      .dwattr $C$DW$558, DW_AT_name("Ki_spd")
    3687                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_Ki_spd")
    3688                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3689                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3690              $C$DW$559       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$31)
    3692                      .dwattr $C$DW$559, DW_AT_name("Kd_Id")
    3693                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_Kd_Id")
    3694                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3695                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3696              $C$DW$560       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$31)
    3698                      .dwattr $C$DW$560, DW_AT_name("Kd_Iq")
    3699                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_Kd_Iq")
    3700                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3701                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3702              $C$DW$561       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$31)
    3704                      .dwattr $C$DW$561, DW_AT_name("Kd_spd")
    3705                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_Kd_spd")
    3706                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3707                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3708              $C$DW$562       .dwtag  DW_TAG_member
    3709                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$31)
    3710                      .dwattr $C$DW$562, DW_AT_name("Ui_Id")
    3711                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_Ui_Id")
    3712                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3713                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3714              $C$DW$563       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$31)
    3716                      .dwattr $C$DW$563, DW_AT_name("Ui_Iq")
    3717                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_Ui_Iq")
    3718                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3719                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3720              $C$DW$564       .dwtag  DW_TAG_member
    3721                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$31)
    3722                      .dwattr $C$DW$564, DW_AT_name("Ui_spd")
    3723                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_Ui_spd")
    3724                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3725                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3726              $C$DW$565       .dwtag  DW_TAG_member
    3727                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$68)
    3728                      .dwattr $C$DW$565, DW_AT_name("Idq_ref")
    3729                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_Idq_ref")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   74

    3730                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3731                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3732              $C$DW$566       .dwtag  DW_TAG_member
    3733                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$31)
    3734                      .dwattr $C$DW$566, DW_AT_name("IdRated")
    3735                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_IdRated")
    3736                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3737                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3738              $C$DW$567       .dwtag  DW_TAG_member
    3739                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$31)
    3740                      .dwattr $C$DW$567, DW_AT_name("spd_ref")
    3741                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_spd_ref")
    3742                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3743                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3744              $C$DW$568       .dwtag  DW_TAG_member
    3745                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$31)
    3746                      .dwattr $C$DW$568, DW_AT_name("spd_max")
    3747                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_spd_max")
    3748                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3749                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3750              $C$DW$569       .dwtag  DW_TAG_member
    3751                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$66)
    3752                      .dwattr $C$DW$569, DW_AT_name("counter_current")
    3753                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_counter_current")
    3754                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3755                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3756              $C$DW$570       .dwtag  DW_TAG_member
    3757                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$66)
    3758                      .dwattr $C$DW$570, DW_AT_name("counter_isr")
    3759                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_counter_isr")
    3760                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3761                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3762              $C$DW$571       .dwtag  DW_TAG_member
    3763                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$66)
    3764                      .dwattr $C$DW$571, DW_AT_name("counter_speed")
    3765                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_counter_speed")
    3766                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3767                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3768              $C$DW$572       .dwtag  DW_TAG_member
    3769                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$66)
    3770                      .dwattr $C$DW$572, DW_AT_name("counter_traj")
    3771                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_counter_traj")
    3772                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3773                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3774              $C$DW$573       .dwtag  DW_TAG_member
    3775                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$69)
    3776                      .dwattr $C$DW$573, DW_AT_name("flag_enableCtrl")
    3777                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3778                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3779                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3780              $C$DW$574       .dwtag  DW_TAG_member
    3781                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$69)
    3782                      .dwattr $C$DW$574, DW_AT_name("flag_enableDcBusComp")
    3783                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3784                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   75

    3785                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3786              $C$DW$575       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$69)
    3788                      .dwattr $C$DW$575, DW_AT_name("flag_enablePowerWarp")
    3789                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3790                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3791                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3792              $C$DW$576       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$69)
    3794                      .dwattr $C$DW$576, DW_AT_name("flag_enableOffset")
    3795                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_flag_enableOffset")
    3796                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3797                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3798              $C$DW$577       .dwtag  DW_TAG_member
    3799                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$69)
    3800                      .dwattr $C$DW$577, DW_AT_name("flag_enableSpeedCtrl")
    3801                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3802                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3803                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3804              $C$DW$578       .dwtag  DW_TAG_member
    3805                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$69)
    3806                      .dwattr $C$DW$578, DW_AT_name("flag_enableUserMotorParams")
    3807                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3808                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3809                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3810              $C$DW$579       .dwtag  DW_TAG_member
    3811                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$68)
    3812                      .dwattr $C$DW$579, DW_AT_name("Idq_offset_pu")
    3813                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3814                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3815                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3816              $C$DW$580       .dwtag  DW_TAG_member
    3817                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$68)
    3818                      .dwattr $C$DW$580, DW_AT_name("Vdq_offset_pu")
    3819                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3820                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3821                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3822              $C$DW$581       .dwtag  DW_TAG_member
    3823                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$31)
    3824                      .dwattr $C$DW$581, DW_AT_name("angle_pu")
    3825                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_angle_pu")
    3826                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3827                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3828              $C$DW$582       .dwtag  DW_TAG_member
    3829                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$31)
    3830                      .dwattr $C$DW$582, DW_AT_name("speed_ref_pu")
    3831                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_speed_ref_pu")
    3832                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3833                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3834              $C$DW$583       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$31)
    3836                      .dwattr $C$DW$583, DW_AT_name("speed_fb_pu")
    3837                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_speed_fb_pu")
    3838                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3839                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   76

    3840              $C$DW$584       .dwtag  DW_TAG_member
    3841                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$31)
    3842                      .dwattr $C$DW$584, DW_AT_name("speed_outMax_pu")
    3843                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3844                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3845                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3846              $C$DW$585       .dwtag  DW_TAG_member
    3847                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$69)
    3848                      .dwattr $C$DW$585, DW_AT_name("flag_enableCurrentCtrl")
    3849                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3850                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3851                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3852                      .dwendtag $C$DW$T$70
    3853              
    3854              $C$DW$T$190     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3855                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$70)
    3856                      .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    3857              $C$DW$T$191     .dwtag  DW_TAG_pointer_type
    3858                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    3859                      .dwattr $C$DW$T$191, DW_AT_address_class(0x20)
    3860              $C$DW$T$159     .dwtag  DW_TAG_pointer_type
    3861                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$70)
    3862                      .dwattr $C$DW$T$159, DW_AT_address_class(0x20)
    3863              $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3864                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$159)
    3865                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3866              $C$DW$586       .dwtag  DW_TAG_TI_far_type
    3867                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$160)
    3868              $C$DW$T$192     .dwtag  DW_TAG_const_type
    3869                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$586)
    3870              
    3871              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    3872                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    3873                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    3874              $C$DW$587       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$22)
    3876                      .dwattr $C$DW$587, DW_AT_name("rsvd")
    3877                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_rsvd")
    3878                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3879                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$588       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$72)
    3882                      .dwattr $C$DW$588, DW_AT_name("targetProc")
    3883                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_targetProc")
    3884                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3885                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3886              $C$DW$589       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$22)
    3888                      .dwattr $C$DW$589, DW_AT_name("major")
    3889                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_major")
    3890                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3891                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3892              $C$DW$590       .dwtag  DW_TAG_member
    3893                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$22)
    3894                      .dwattr $C$DW$590, DW_AT_name("minor")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   77

    3895                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_minor")
    3896                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3897                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3898                      .dwendtag $C$DW$T$73
    3899              
    3900              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3901                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    3902                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3903              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    3904                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$37)
    3905                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    3906              
    3907              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3908                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3909                      .dwattr $C$DW$T$19, DW_AT_declaration
    3910                      .dwendtag $C$DW$T$19
    3911              
    3912              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3913                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
    3914                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    3915              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3916                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3917                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3918              
    3919              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3920                      .dwattr $C$DW$T$74, DW_AT_name("_FILTER_FO_")
    3921                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    3922              $C$DW$591       .dwtag  DW_TAG_member
    3923                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$31)
    3924                      .dwattr $C$DW$591, DW_AT_name("a1")
    3925                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_a1")
    3926                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3927                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3928              $C$DW$592       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$31)
    3930                      .dwattr $C$DW$592, DW_AT_name("b0")
    3931                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_b0")
    3932                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3933                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3934              $C$DW$593       .dwtag  DW_TAG_member
    3935                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$31)
    3936                      .dwattr $C$DW$593, DW_AT_name("b1")
    3937                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_b1")
    3938                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3939                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3940              $C$DW$594       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$31)
    3942                      .dwattr $C$DW$594, DW_AT_name("x1")
    3943                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_x1")
    3944                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3945                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3946              $C$DW$595       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$31)
    3948                      .dwattr $C$DW$595, DW_AT_name("y1")
    3949                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_y1")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   78

    3950                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3951                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3952                      .dwendtag $C$DW$T$74
    3953              
    3954              $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    3955                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$74)
    3956                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    3957              
    3958              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3959                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    3960                      .dwattr $C$DW$T$20, DW_AT_declaration
    3961                      .dwendtag $C$DW$T$20
    3962              
    3963              $C$DW$T$130     .dwtag  DW_TAG_pointer_type
    3964                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$20)
    3965                      .dwattr $C$DW$T$130, DW_AT_address_class(0x20)
    3966              $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    3967                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$130)
    3968                      .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    3969              
    3970              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3971                      .dwattr $C$DW$T$75, DW_AT_name("_FLASH_Obj_")
    3972                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    3973              $C$DW$596       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$23)
    3975                      .dwattr $C$DW$596, DW_AT_name("FOPT")
    3976                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_FOPT")
    3977                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3978                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3979              $C$DW$597       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$23)
    3981                      .dwattr $C$DW$597, DW_AT_name("rsvd_1")
    3982                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_rsvd_1")
    3983                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3984                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3985              $C$DW$598       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$23)
    3987                      .dwattr $C$DW$598, DW_AT_name("FPWR")
    3988                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_FPWR")
    3989                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3990                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3991              $C$DW$599       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$23)
    3993                      .dwattr $C$DW$599, DW_AT_name("FSTATUS")
    3994                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_FSTATUS")
    3995                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3996                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3997              $C$DW$600       .dwtag  DW_TAG_member
    3998                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$23)
    3999                      .dwattr $C$DW$600, DW_AT_name("FSTDBYWAIT")
    4000                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4001                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4002                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4003              $C$DW$601       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   79

    4005                      .dwattr $C$DW$601, DW_AT_name("FACTIVEWAIT")
    4006                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4007                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4008                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4009              $C$DW$602       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$23)
    4011                      .dwattr $C$DW$602, DW_AT_name("FBANKWAIT")
    4012                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_FBANKWAIT")
    4013                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4014                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4015              $C$DW$603       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$23)
    4017                      .dwattr $C$DW$603, DW_AT_name("FOTPWAIT")
    4018                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_FOTPWAIT")
    4019                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4020                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4021                      .dwendtag $C$DW$T$75
    4022              
    4023              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    4024                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$75)
    4025                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    4026              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4027                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4028                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4029              
    4030              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4031                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
    4032                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
    4033              $C$DW$604       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$76)
    4035                      .dwattr $C$DW$604, DW_AT_name("GPACTRL")
    4036                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_GPACTRL")
    4037                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4038                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$605       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$76)
    4041                      .dwattr $C$DW$605, DW_AT_name("GPAQSEL1")
    4042                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_GPAQSEL1")
    4043                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4044                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$606       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$76)
    4047                      .dwattr $C$DW$606, DW_AT_name("GPAQSEL2")
    4048                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_GPAQSEL2")
    4049                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4050                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$607       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$76)
    4053                      .dwattr $C$DW$607, DW_AT_name("GPAMUX1")
    4054                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_GPAMUX1")
    4055                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4056                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$608       .dwtag  DW_TAG_member
    4058                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$76)
    4059                      .dwattr $C$DW$608, DW_AT_name("GPAMUX2")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   80

    4060                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_GPAMUX2")
    4061                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4062                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4063              $C$DW$609       .dwtag  DW_TAG_member
    4064                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$76)
    4065                      .dwattr $C$DW$609, DW_AT_name("GPADIR")
    4066                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_GPADIR")
    4067                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4068                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4069              $C$DW$610       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$76)
    4071                      .dwattr $C$DW$610, DW_AT_name("GPAPUD")
    4072                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_GPAPUD")
    4073                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4074                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4075              $C$DW$611       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$26)
    4077                      .dwattr $C$DW$611, DW_AT_name("rsvd_1")
    4078                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_rsvd_1")
    4079                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4080                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4081              $C$DW$612       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$76)
    4083                      .dwattr $C$DW$612, DW_AT_name("GPBCTRL")
    4084                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_GPBCTRL")
    4085                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4086                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4087              $C$DW$613       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$76)
    4089                      .dwattr $C$DW$613, DW_AT_name("GPBQSEL1")
    4090                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_GPBQSEL1")
    4091                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4092                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4093              $C$DW$614       .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$26)
    4095                      .dwattr $C$DW$614, DW_AT_name("rsvd_2")
    4096                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_rsvd_2")
    4097                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4098                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4099              $C$DW$615       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$76)
    4101                      .dwattr $C$DW$615, DW_AT_name("GPBMUX1")
    4102                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_GPBMUX1")
    4103                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4104                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$616       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$26)
    4107                      .dwattr $C$DW$616, DW_AT_name("rsvd_3")
    4108                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_rsvd_3")
    4109                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4110                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$617       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$76)
    4113                      .dwattr $C$DW$617, DW_AT_name("GPBDIR")
    4114                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_GPBDIR")
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   81

    4115                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4116                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$618       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$76)
    4119                      .dwattr $C$DW$618, DW_AT_name("GPBPUD")
    4120                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_GPBPUD")
    4121                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4122                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$619       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$77)
    4125                      .dwattr $C$DW$619, DW_AT_name("rsvd_4")
    4126                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_rsvd_4")
    4127                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4128                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$620       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$76)
    4131                      .dwattr $C$DW$620, DW_AT_name("AIOMUX1")
    4132                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_AIOMUX1")
    4133                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4134                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$621       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$26)
    4137                      .dwattr $C$DW$621, DW_AT_name("rsvd_5")
    4138                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_rsvd_5")
    4139                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4140                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$622       .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$76)
    4143                      .dwattr $C$DW$622, DW_AT_name("AIODIR")
    4144                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_AIODIR")
    4145                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4146                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$623       .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$78)
    4149                      .dwattr $C$DW$623, DW_AT_name("rsvd_6")
    4150                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_rsvd_6")
    4151                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4152                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$624       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$76)
    4155                      .dwattr $C$DW$624, DW_AT_name("GPADAT")
    4156                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_GPADAT")
    4157                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4158                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$625       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$76)
    4161                      .dwattr $C$DW$625, DW_AT_name("GPASET")
    4162                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_GPASET")
    4163                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4164                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$626       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$76)
    4167                      .dwattr $C$DW$626, DW_AT_name("GPACLEAR")
    4168                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_GPACLEAR")
    4169                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
TMS320C2000 Assembler PC v6.4.9 Wed Dec 02 17:22:56 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ywcheng\AppData\Local\Temp\5808410                          PAGE   82

    4170                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$627       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$76)
    4173                      .dwattr $C$DW$627, DW_AT_name("GPATOGGLE")
    4174                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_GPATOGGLE")
